{"Flickr":{"name":"Flickr","actions": ["Upload the thumbnail to Flickr"],"triggers":[],"flows":[]},"Tumblr": {"triggers": ["New post in my blog", "New post on a blog you follow", "I like a post", "I reblog a post"], "flows": [["Tumblr to Slack", "Send me a Slack message when blogs I love list new articles.\n\nHow it works:\n\nWHEN someone posts articles from a blog that I follow on Tumblr...\n\nTHEN post it to a Slack channel."], ["Tumblr Tweet", "Automatically tweet posts I like on Tumblr.\n\nHow it works:\nWHEN I like a post on Tumblr...\n\nTHEN tweet the post on Twitter."], ["Insta Tumblr", "Create a new blog post on Tumblr when you post on Instagram.\n\nHow it works:\nWHEN I post a new photo or video on Instagram...\n\nTHEN create a new blog post on Tumblr."], ["Facebook Posts", "Create a post on Facebook when you mark a photo a favorite on Flickr or when you like a post on Tumblr.\n\nHow it works:\nWHEN I mark a public photo favorite on Flickr...\n\nOR\n\nWHEN I like a post on Tumblr...\n\nTHEN create a post on Facebook."], ["New Post", "Receive an alert when a Tumblr blog you follow has a new post by Blinking your LIFX and receiving a notification with the information.\n\nHow it works:\nWHEN there is a new post in a blog I follow on Tumblr...\n\nTHEN blink my LIFX Color blue 40 times,\nAND send me a push notification."], ["Reblogging", "When you reblog a post on Tumblr, post it to Twitter as well, and if you are at the correct location then turn on your Hue to navy blue and fade off over 3 minutes.\n\nHow it works:\nWHEN I reblog a post on Tumblr,\n\nTHEN tweet the post on Twitter,\n\nAND ONLY IF I am at a Location...\n\nTHEN turn on my Hue Bulb A19 to navy blue,\n\nTHEN fade off my Hue Bulb A19 over 3 minutes."]], "actions": ["Create a new blog post"], "name": "Tumblr"}, "Foursquare Swarm": {"name": "Foursquare Swarm", "flows": [["Social Check In", "Tweet your Foursquare Check-Ins on Twitter.\n\nHow it works:\nWHEN I check-in at a venue on Foursquare Swarm...\n\nTHEN tweet on Twitter the venue name and location."], ["Sales Call", "Save your Foursquare Check-In info to a Google Sheet.\n\nHow it works:\nWHEN I check-in at a venue on Foursquare Swarm...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with all the location info,\nAND send me an Email."], ["Heads Up", "Send your Stringify Friend a Notification when you check in on Foursquare Swarm.\n\nHow it works:\nWHEN I check-in at a venue on Foursquare Swarm...\n\nTHEN send my friend a push notification with the info."], ["Location, Location", "Turn your Hue orange when your location is home but someone checks in at a venue on Foursquare Swarm.\n\nHow it works:\nWHEN someone checks-in at a venue on Foursquare Swarm,\nBUT ONLY IF I am at my home Location...\n\nTHEN turn on my Hue Bulb A19 to a color,\nAND send me an Email with the venue...\n\nTHEN start a Timer for 10 minutes...\n\nTHEN turn off the Hue."], ["Road Trip Notes", "Track latitude and longitude from your Foursquare check-ins on Evernote.\n\nHow it works:\nWHEN I check-in at a venue on Foursquare Swarm...\n\nTHEN append to a note on Evernote with venue name, latitude and longitude."], ["Multi Account Tracker", "Save check-ins from multiple Foursquare Swarm accounts to a Google Sheet.\n\nHow it works:\nWHEN an account checks-in at a venue on Foursquare Swarm...\n\nOR\n\nWHEN a different account checks-in at a venue on Foursquare Swarm...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with all the info."]], "actions": [], "triggers": ["I check-in at a venue"]}, "Slack": {"name": "Slack", "flows": [["New Twitter Follower", "Post a new Twitter Follower info to Slack and save in a Google Drive Sheet.\n\nHow it works:\nWHEN I have a new follower on Twitter...\n\nTHEN post a message to a channel on Slack,\nAND add a row to a Google Sheets spreadsheet on my Google Drive."], ["Slack Latest Smarthome News", "Post the latest smarthome news from CNET, Mashable, Buzzfeed and TechCrunch to Slack.\n\nHow it works:\nWHEN a new smarthome story is added on TechCrunch...\n\nOR\n\nWHEN a new smarthome post is added on BuzzFeed...\n\nOR\n\nWHEN there is a new smarthome item on the Mashable RSS Feed...\n\nOR\n\nWHEN a new smarthome post is added on CNET...\n\nTHEN post the message to a channel on Slack."], ["Insta-Slack", "Automatically share your Instagram posts on Slack.\n\nHow it works:\nWHEN I post a new photo or video on Instagram...\n\nTHEN post a message to a channel on Slack."], ["Meeting Time", "Use Alexa to give the team a heads up via Slack that a meeting is about to start.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Meeting Time\"...\n\nTHEN post a message to a channel on Slack."], ["Weather Report", "Post tomorrow's weather report to Slack every day at 5pm.\n\nHow it works:\nWHEN a weather report is generated on Weather every day at 5pm...\n\nTHEN post a message to a channel on Slack with the report."], ["5 Minute Meeting Reminder", "Post a reminder to Slack 5 minutes before a Google Calendar meeting begins and also turn on a LIFX light bulb in the meeting room.\n\nHow it works:\nWHEN it's 5 minutes before any event starts on my Google calendar...\n\nTHEN post a message to a channel on Slack,\nAND turn on my LIFX Color."]], "actions": ["Post a message to a Slack channel", "Post a message to a Slack user", "Post a message to a Slack private group"], "triggers": []}, "Dropbox": {"name": "Dropbox", "flows": [["Power Backup", "Power back up your files across multiple online services\nWHEN a new file is in my Dropbox folder...\n\nTHEN upload a file to my Google Drive,\nAND upload a file to my Box."], ["File Update Alert", "Get alert when a file is updated in your Dropbox folder\n\nWHEN a file in your Dropbox folder is updated\n\nTHEN send me a slack message\nAND send me a notification"], ["Back Up Security Video", "Back up your security videos to Dropbox every time it's recorded\nWHEN New motion detected,\nONLY IF I am away from a Location ...\n\nTHEN Record video...\n\nTHEN upload a file to my Dropbox,\nAND send me a push notification."], ["Who's There?", "Save the video from Ring to your Dropbox anytime it detects motion\n\nWHEN my Ring Doorbell detects motion (with video)...\n\nTHEN upload a file to my Dropbox,\nAND send me a push notification."], ["Social Backup", "Back up photos and videos you post on Facebook and Instagram\n\nWHEN I create a new post on Facebook...\n\nTHEN upload a file to my Dropbox\nWHEN I post a new photo or video on Instagram...\n\nTHEN upload a file to my Dropbox."]], "actions": ["Upload a file", "Create a text file"], "triggers": ["New file in my Dropbox folder", "A file in my Dropbox folder is updated"]}, "Traffic": {"triggers": ["Travel time to a destination is greater than", "Travel time to a destination is less than"], "flows": [["Click For Commute", "Tap the button between 4pm and 7pm on the weekdays to receive a traffic report about your commute home.\n\nHow it works:\nWHEN I press the Button,\nONLY IF the Time is between 4pm and 7pm on a weekday...\n\nTHEN get the travel time between two addresses on Traffic...\n\nTHEN send me a push notification with the travel time, fastest path home summary and URL."], ["Daily Commute", "Let Hue alert you when traffic to work is backed up\n\nWHEN the traffic to work from home is backed up...\n\nTHEN turn the kitchen Hue to amber...\nAND send me a notification with fastest route to work."], ["Evening Commute", "Get the fastest way home after work via Traffic powered by Google when you start the car.\n\nHow it works:\n\nWHEN I turn on the ignition on my Automatic enabled car,\nAND ONLY IF the Time is after 5:00 pm...\n\nTHEN generate a Traffic report between my work and home...\n\nTHEN send me a Notification with the fastest route home."], ["Leaving Work Alert", "Flow that lets your spouse know when to expect you home and sends you the fastest path home.\n\nHow it works:\nWHEN my Location leaves the office area,\nAND the Time is after 5pm on a weekday...\n\nTHEN generate a Google Traffic report between work and home...\n\nTHEN send my Friend a notification with the estimated travel time,\nAND send me an Email with the fastest route and map URL."], ["Headed Home", "Turning on the ignition after work sends notifications to yourself and your spouse for arrival times.\n\nHow it works:\n\nWHEN the ignition is started in my Automatic enabled car,\nAND the Time is after 5 pm...\n\nTHEN generate a Google Traffic report between work and home...\n\nTHEN send me a Notification with the fastest route info,\nAND send my Friend a Notification with the time it will take."], ["Heavy Traffic", "Turn your LIFX orange and receive a Notification with a traffic report when it takes longer than 30 minutes to get to work during a weekday morning.\n\nHow it works:\nWHEN travel time to a destination is greater than 30 minutes on Traffic,\nONLY IF the Time is between 6am and 9am during the week...\n\nTHEN send me a push notification with the traffic summary,\nAND turn on my LIFX Color to orange."], ["Game Day Transportation", "Get game day updates for public transportation to the stadium by tapping the button.\n\nHow it works:\nWHEN I press the Button...\n\nTHEN get the travel time between two addresses via public transportation on Traffic...\n\nTHEN send me a push notification with the information."]], "actions": ["Get travel time between two addresses"], "name": "Traffic"}, "Garageio": {"name": "Garageio", "flows": [["Close When Rainy", "Close the Garageio enabled garage door when it's rainy and send a Notification with the weather.\n\nHow it works:\nWHEN the weather condition changes to a value on Weather...\n\nTHEN close the door using my Garageio,\nAND send me a Notification."], ["Close When Leaving", "Close the Garageio enabled garage door when leaving home and send a Notification letting me know.\n\nHow it works:\nWHEN I leave a Location area...\n\nTHEN close the door using my Garageio,\nAND send me a Notification."], ["Open When Arriving", "Open your Garageio enabled garage door when you arrive home, and only if it's nighttime then turn on the light.\n\nHow it works:\nWHEN I enter my home Location area...\n\nTHEN open the door using my Garageio...\n\nAND ONLY IF it is nighttime...\n\nTHEN turn on my Dimmer Switch."], ["Garage at Sunset", "If the Garageio enabled garage door is open at sunset, then close it.\n\nHow it works:\nWHEN it is sunset,\nONLY IF my Garageio door is open...\n\nTHEN close the door using my Garageio."], ["Giddyup!", "Open my Garageio enabled garage door when I turn on the ignition in my Automatic enabled car and my location is home.\n\nHow it works:\nWHEN the ignition turns on in my Automatic enabled car,\nONLY IF I am at my home Location...\n\nTHEN open the door using my Garageio,\nAND send me a push notification."], ["\"Alexa, turn on garage door.\"", "Say \"Alexa, turn on garage door\" to open you Garageio enabled garage door, but only if you are at home.\n\nHow it works:\nWHEN I ask Amazon Alexa to run a Flow,\nBUT ONLY IF I am at my home Location...\n\nTHEN open the door using my Garageio."]], "actions": ["Open door", "Close door"], "triggers": ["Door opens", "Door closes", "Door is open for a duration", "Door is closed for a duration", "Open", "Closed"]}, "Rachio": {"name": "Rachio", "flows": [["Watering Records", "Track your watering schedule from your Rachio in a Google Sheet.\n\nHow it works:\nWHEN my watering schedule starts on my Rachio ...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Rain Delay", "Add a rain delay to you Rachio when there is rain predicted for tomorrow.\n\nHow it works:\nWHEN the weather condition changes to rain tomorrow on Weather...\n\nTHEN add a rain delay on my Rachio 16 Zones."], ["Add a Rain Delay", "Add a rain delay to your Rachio through Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify add a rain delay\"...\n\nTHEN add a rain delay on my Rachio."], ["Scarecrow", "Turn on a zone on your Rachio for 2 minutes when your Arlo detects motion.\n\nHow it works:\nWHEN motion is detected on my Arlo...\n\nTHEN start a zone on my Rachio for 2 minutes."], ["Raccoons", "When motion is detected at nighttime, briefly turn on your Rachio sprinklers and a spotlight.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF it is nighttime...\n\nTHEN turn on my Dimmer Switch,\nAND start my Timer,\nAND start a zone on my Rachio...\n\nTHEN turn off my Dimmer Switch."], ["Too Cold To Water", "Stop all watering in your Rachio when the temperature drops below 40F.\n\nHow it works:\nWHEN the temperature falls below 40F on Weather...\n\nTHEN stop all watering on my Rachio,\nAND send me a push notification."]], "actions": [], "triggers": []}, "Button (Scene)": {"name": "Button (Scene)", "flows": [["Coming Home", "WHEN I press the Button,\nONLY IF the Time is after 5:30 pm...\n\nTHEN turn on my LIFX Group\nWHEN I press the Button...\n\nTHEN set the temperature on my Nest Thermostat to 72 F."], ["Leaving Home", "WHEN I press the Button,\nONLY IF the Time is between 7:30am and 9:30am...\n\nTHEN turn off my Hue Color Light,\nAND set my Ecobee to Away,\nAND get the travel time between two addresses on Traffic...\n\nTHEN send me a push notification with fastest route summary"], ["Movie Time", "WHEN I press the Movie Time Button...\n\nTHEN set the temperature on my Nest Thermostat,\nAND start an activity on my Logitech Harmony,\nAND fade off my Hue Color Light."], ["Commute", "WHEN I press the Commute Button...\n\nTHEN get the travel time between two addresses on Traffic...\n\nTHEN send me a push notification with fastest route summary"], ["Party", "WHEN I press the Party Button...\n\nTHEN color fade my LIFX Group between two colors\nAND start an activity on my Logitech Harmony."], ["30 Min Timer", "WHEN I press the Timer Button...\n\nTHEN turn on my Hue Color Light to green,\nAND start my Timer for 25 mins...\n\nTHEN turn on my Hue Color Light to yellow\nAND start my Timer for 5 mins...\n\nTHEN turn on my Hue Color Light to red,\nAND start my Timer for 10 mins...\n\nTHEN turn off my Hue Color Light."]], "actions": [], "triggers": ["When you press this button"]}, "Wink": {"triggers": [], "flows": [["Alexa Toggle", "Toggle your Insteon keypad with Amazon Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify toggle\"...\n\nTHEN toggle my Insteon keypad."], ["Lock Up", "Automatically lock up the door and turn off the house lights when leaving For work\n\nWHEN I leave a Location area around home,\nONLY IF the Time is between 7:30 am and 9:30 am...\n\nTHEN turn off my Hue Color Light,\nAND lock my Lock."], ["Draft In Here", "When the door has been open for 5 minutes and you are at home, then turn off the Nest Thermostat and turn your Hue blue.\n\nHow it works:\nWHEN my Contact Sensor is open for 5 minutes,\nONLY IF I am at my home Location...\n\nTHEN turn off my Nest Thermostat,\nAND turn on my Hue Bulb A19 to blue."], ["Motion = Red", "Turn your Hue on red and fade it off over 3 minutes when there is a new motion detected and you aren't at home.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF I am away from my home Location ...\n\nTHEN turn on my Hue Bulb A19 to red...\n\nTHEN fade off my Hue Bulb A19 over 3 minutes."], ["Smart Alert", "Quick alarm system that turns on a light for 5 minutes and calls a phone number via IFTTT when your location is not at home and either a motion is detected or the door opens. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN my Open/Close Sensor opens,\n\nOR\n\nWHEN a new motion is detected on my Motions sensor...\n\nAND ONLY IF I am away from my home Location ...\n\nTHEN turn on my Dimmer Switch,\nAND run an IFTTT Applet to call a phone number...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Movie Night with Alexa", "Have Alexa turn on the TV and Roku through Logitech Harmony and set your Z-Wave dimmers to 15%.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify movie night\"...\n\nTHEN start a movie night activity on my Logitech Harmony,\nAND Fade the Dimmer on to 15% brightness."]], "actions": ["Activate a shortcut"], "name": "Wink"}, "New York Times": {"name": "New York Times", "flows": [["Book Worm", "Book updates from NYT and Buzzfeed via push notifications.\n\nHow it works:\nWHEN there is a new book added to the fiction best seller list on New York Times...\n\nOR\n\nWHEN there is a new book added to the non-fiction best seller list on New York Times...\n\nOR\n\nWHEN a new post is added to the book section on BuzzFeed...\n\nTHEN send me a push notification."], ["Biz Notes", "Keep up to date by saving Business off NYT and CNN to Evernote.\n\n\nHow it works:\nWHEN a new article is added to the Business section on New York Times...\n\nOR\n\nWHEN a new story is added to the Business section on CNN...\n\nTHEN append to a note on Evernote."], ["Super Fan", "Get the latest sports articles on Yahoo and The New York Times in your inbox.\n\nHow it works:\nWHEN a new story is added to the sports section on Yahoo News...\n\nOR\n\nWHEN there is a new top story in a section on New York Times...\n\nTHEN send me an Email with the information."], ["Healthy Living", "Blink your LIFX green and receive a Notification when there is a new story posted in the health section of the New York Times.\n\nHow it works:\nWHEN there is a new top story in the Health section on New York Times...\n\nTHEN blink my LIFX Color green,\nAND send me a push notification with the story."], ["New Movie", "Turn your Hue pink for 15 minutes and receive an email when there is a new movie in the Critics Pick on the New York Times.\n\nHow it works:\nWHEN there is a new movie added to the Critics' Pick on New York Times...\n\nTHEN start my Timer for 15 minutes,\nAND turn on my Hue Bulb A19 to pink,\nAND send me an Email...\n\nTHEN turn off my Hue Bulb A19."], ["Auto News", "Receive a Notification when there is a popular article in the Automobile section of The New York Times.\n\nHow it works:\nWHEN a new popular article is in the Automobile section on New York Times...\n\nTHEN send me a push notification."]], "actions": [], "triggers": ["New article added to a section", "New popular article in a section", "New top stories in a section", "New story based on search terms", "New book added to best seller list", "New movie added to Critics’ Pick"]}, "SmartThings": {"name": "SmartThings", "flows": [["Alexa Toggle", "Toggle your Insteon keypad with Amazon Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify toggle\"...\n\nTHEN toggle my Insteon keypad."], ["Lock Up", "Automatically lock up the door and turn off the house lights when leaving For work\n\nWHEN I leave a Location area around home,\nONLY IF the Time is between 7:30 am and 9:30 am...\n\nTHEN turn off my Hue Color Light,\nAND lock my Lock."], ["Draft In Here", "When the door has been open for 5 minutes and you are at home, then turn off the Nest Thermostat and turn your Hue blue.\n\nHow it works:\nWHEN my Contact Sensor is open for 5 minutes,\nONLY IF I am at my home Location...\n\nTHEN turn off my Nest Thermostat,\nAND turn on my Hue Bulb A19 to blue."], ["Motion = Red", "Turn your Hue on red and fade it off over 3 minutes when there is a new motion detected and you aren't at home.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF I am away from my home Location ...\n\nTHEN turn on my Hue Bulb A19 to red...\n\nTHEN fade off my Hue Bulb A19 over 3 minutes."], ["Smart Alert", "Quick alarm system that turns on a light for 5 minutes and calls a phone number via IFTTT when your location is not at home and either a motion is detected or the door opens. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN my Open/Close Sensor opens,\n\nOR\n\nWHEN a new motion is detected on my Motions sensor...\n\nAND ONLY IF I am away from my home Location ...\n\nTHEN turn on my Dimmer Switch,\nAND run an IFTTT Applet to call a phone number...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Movie Night with Alexa", "Have Alexa turn on the TV and Roku through Logitech Harmony and set your Z-Wave dimmers to 15%.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify movie night\"...\n\nTHEN start a movie night activity on my Logitech Harmony,\nAND Fade the Dimmer on to 15% brightness."]], "actions": [], "triggers": []}, "Ring": {"name": "Ring", "flows": [["Who Rang?", "Keep a log on Google Drive of who rings your door bell when you are away from home\n\nWHEN my Ring Doorbell doorbell rings (with video),\nONLY IF I am away from a Location ...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Simple Motion", "Turn on your white light bulb for 2 minutes when your Ring Stick Up Cam detects motion at night.\n\nHow it works:\nWHEN my Ring Stick Up Cam detects motion,\nONLY IF it is nighttime...\n\nTHEN turn on my White Light Bulb,\nAND start my Timer for 2 minutes...\n\nTHEN turn off my White Light Bulb."], ["Ring Lights On", "Turn on your Hue for 10 minutes when someone rings your Ring doorbell after dark and you are away from home.\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings,\nONLY IF it is nighttime,\nAND ONLY IF I am away from a Location ...\n\nTHEN turn on my Hue Bulb A19...\n\nTHEN start my Timer for 10 minutes...\n\nTHEN turn off my Hue Bulb A19."], ["Faithful Fido", "Play a dog bark sound over your Sonos connected via SmartThings when your Ring Stick Up Cam detects motion.\n\nHow it works:\nWHEN my Ring Stick Up Cam detects motion...\n\nTHEN play a dog bark sound on my Sonos connected via SmartThings."], ["Whole Home Ring", "Extend your Ring doorbell throughout your home by sending a doorbell chime over Sonos connected via SmartThings (works great when you are in the backyard).\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings...\n\nTHEN play a door bell chime on my Sonos connected via SmartThings."], ["Ring Blink", "Blink your LIFX green 30 times when someone presses your Ring doorbell.\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings...\n\nTHEN blink my LIFX Color green 30 times."], ["Occupied Home", "Make your home look occupied when Ring detects a motion by both turning on your Hue and running a music activity on your Logitech Harmony for 15 minutes.\n\nHow it works:\nWHEN my Ring Doorbell detects motion,\nONLY IF I am away from a Location ...\n\nTHEN turn on my Hue Bulb A19,\nAND start an activity on my Logitech Harmony,\nAND start my Timer for 15 minutes...\n\nTHEN stop an activity on my Logitech Harmony,\nAND turn off my Hue Bulb A19."], ["Ring While I'm Away", "Turn on all your Hues when someone presses your Ring doorbell and you are away from your Nest home.\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings,\nONLY IF my Nest Home status is Away...\n\nTHEN turn on my Hue Group,\nAND start my Timer for 15 minutes...\n\nTHEN turn off my Hue Group."]], "actions": [], "triggers": []}, "Withings": {"triggers": ["Steps Above", "Steps below", "New sleep logged", "Sleep duration above", "Sleep duration below", "New heart rate measurement", "New weight measurement", "Weight above", "Weight below", "New blood pressure measurement"], "flows": [["Dad's BP", "Keep track of Dad's BP with Withings, Google Drive and Notifications.\n\nHow it works:\n\nWHEN a new blood pressure measurement is taken on Withings...\n\nTHEN send me a Notification with the info,\nAND send my Friend (spouse) an Email with the info,\nAND log the info in a Google Drive Sheet."], ["Weight Tracker", "Track your Withings weight on a Google Drive Sheet automatically.\n\nHow it works:\n\nWHEN I have a new weight measurement on Withings...\n\nTHEN log the info on Google Drive."], ["Chubby Buddy", "Celebrate keeping your weight down on your Withings scale with Hue and a Connected Speaker via SmartThings.\n\nHow it works:\n\nWHEN my weight is under 200 lbs on Withings...\n\nTHEN turn my Hue on to green,\nAND play a cheer sound over my Connected Speaker via SmartThings,\nAND send me a Notification with the info."], ["Power Walk Partners", "Get help from a Friend to reach your steps goal on Withings by sending a weather report via Notification at 4pm if you are short of 7000 steps.\n\nHow it works:\nWHEN my steps are below 7000 on my Withings at 4pm,\nONLY IF the Time is between noon and 6pm during a weekday...\n\nTHEN generate a weather report on Weather...\n\nTHEN send my friend a push notification with the weather and a power walk request,\nAND send me a push notification."], ["Green = Goal", "Celebrate reaching your steps goal on Withings by turning your Hue green for 5 minutes at 8pm when you have reached 10,000 steps.\n\nHow it works:\nWHEN my steps are above 10,000 on my Withings by 8pm...\n\nTHEN turn on my Hue Bulb A19 to green,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Hue Bulb A19."]], "actions": [], "name": "Withings"}, "Coinbase": {"name": "Coinbase", "flows": [["Bitcoin Alert", "WHEN the price of Bitcoin rises above a value on Coinbase...\n\nTHEN send me a push notification,\nAND add a row to a Google Sheets spreadsheet on my Google Drive."], ["Ethereum Below 200", "WHEN the price of Ethereum drops below a value on Coinbase...\n\nTHEN send me a push notification,\nAND add a row to a Google Sheets spreadsheet on my Google Drive."], ["Bitcoin Buy Alert", "WHEN the price of Bitcoin drops below a value on Coinbase...\n\nTHEN send me a push notification,\nAND add a row to a Google Sheets spreadsheet on my Google Drive."], ["Litecoin Drops", "WHEN the price of Litecoin falls below a value on Coinbase...\n\nTHEN send me a push notification,\nAND send my friend a push notification."]], "actions": ["Get current price"], "triggers": ["Price rises above", "Price falls below", "Price is above", "Price is below"]}, "Connect: Flow": {"name": "Connect: Flow", "flows": [], "actions": ["Run the selected Flow"], "triggers": ["Start whichever Flow this is included in"]}, "Google Assistant": {"name": "Google Assistant", "flows": [["A Google Morning", "Tell Google to run Good Morning and set your Nest temperature, turn on your Hue bulbs and read a weather report over your Sonos connected via SmartThings.\n\nHow it works:\nWHEN I say \"OK Google, tell Stringify Good Morning\"...\n\nTHEN generate a weather report on Weather,\nAND turn on my Hue Bulb A19,\nAND set the heat/cool temperature on my Nest Thermostat to 69F...\n\nTHEN play the weather on my Sonos connected via SmartThings."], ["A Google Night", "Get a great night's sleep by telling Google Home good night and turn on your Hue to a dim orange while fading it off over 10 minutes and also set your Nest Thermostat to 68F.\n\nHow it works:\nWHEN I say \"OK Google, tell Stringify Good Night\"...\n\nTHEN turn on my Hue Bulb A19 to orange at 15% brightness,\nAND set the cool temperature on my Nest Thermostat to 69F...\n\nTHEN fade off my Hue Bulb A19 over 10 minutes."], ["Google Spotlights", "Turn on your spotlights for 5 minutes using Google Home.\n\nHow it works:\nWHEN I say \"Google tell Stringify spotlights\"...\n\nTHEN turn on my Dimmer Switch,\nAND set my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Google Game Time", "Get ready for the game by asking Google and having your LIFX bulbs fade from red to white (change the colors to match your team).\n\nHow it works:\nWHEN I say \"OK Google, tell Stringify Game Time\"...\n\nTHEN color fade my LIFX Group between red and white every 30 seconds."], ["TV Time", "Turn on your entire TV Setup via Logitech Harmony and set your Hue lights to a warm / dim light by asking Google.\n\nHow it works:\nWHEN I say \"OK Google, tell Stringify TV Time\"...\n\nTHEN start my TV activity on my Logitech Harmony,\nAND turn on my Hue Color Light to a warm white at 70% brightness."], ["Google Gives Timeouts", "Make giving kids a timeout so much easier by asking Google and having your Hue light bulb turn red for 5 minutes then green for 2 before turning off.\n\nHow it works:\nWHEN I say \"OK Google, tell Stringify Timeout\"...\n\nTHEN turn on my Hue Bulb A19 to red,\nAND start my Timer for 5 minutes...\n\nTHEN turn on my Hue Bulb A19 to green,\nAND start my Timer for 2 minutes...\n\nTHEN turn off my Hue Bulb A19."]], "actions": [], "triggers": ["Ask Google to run a flow"]}, "CNET": {"name": "CNET", "flows": [["CNET Smart Home", "Blink your lights when you get a smart home alert in CNET.\n\nHow it works:\nWHEN a new post is added based on Smart Home search terms on CNET...\n\nTHEN blink my LIFX Color,\nAND send me a push notification."], ["Learn Something New", "Receive an Email when there are new posts to CNET or Interesting Things RSS Feed.\n\nHow it works:\nWHEN there is a new item added to the Interesting Thjngs of the Day RSS Feed...\n\nOR\n\nWHEN a new post is added to the How To feed on CNET...\n\nTHEN send me an Email with the title, description and URL."], ["Ever-Deals", "Keep a running list of CNET deals on Evernote.\n\nHow it works:\nWHEN a new post is added to the Deals feed on CNET...\n\nTHEN append to a note on Evernote."], ["Gaming Stuff", "Get gaming updates from Craigslist and CNET.\n\nHow it works:\nWHEN a new post is added to the search results on Craigslist...\n\nOR\n\nWHEN a new post is added based on search terms on CNET...\n\nTHEN turn on my Hue Bulb A19 to a color,\nAND send me an Email...\n\nTHEN fade off my Hue Bulb A19."], ["Cheap-Tronics", "Save clearance type deals on electronics from CNET and eBay to a Google Drive Sheet.\n\nHow it works:\nWHEN a new post is added to the cheapskate feed on CNET...\n\nOR\n\nWHEN there is a new post added to the search results of \"clearance electronics\" on eBay...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Cool Pics", "Post the latest CNET Crave pics to Twitter and Flickr.\n\nHow it works:\nWHEN a new post is added to the Crave feed on CNET...\n\nTHEN tweet the title, URL and pic on Twitter,\nAND upload the thumbnail to Flickr."]], "actions": [], "triggers": ["New post added to the feed", "New post based on search term"]}, "Lutron Caséta": {"name": "Lutron Caséta", "flows": [["Coming Home In The Evening", "Turn your lights on when coming home in the evening\n\nWHEN I enter a Location area around house,\nONLY IF the Time is after 5:30 pm...\n\nTHEN turn on my Dimmer Switch,\nAND turn on my Dimmer Switch."], ["Good Morning", "WHEN the Date and Time is a value,\nONLY IF I am at a Location...\n\nTHEN Fade on or off,\nAND Fade on or off,\nAND generate a weather report on Weather...\n\nTHEN send me a push notification."], ["Porch Light", "A simple solution to turn on your front porch light when motion is detected after dark. Automatically turns off after 10 minutes to save energy.\n\nHow It Works:\nWHEN Motion is detected on the front porch,\nAND ONLY IF the Time is nighttime,\nAND ONLY IF the porch light Dimmer is off...\n\nTHEN turn on the porch light Dimmer,\nAND set a Timer for 10 minutes...\n\nTHEN turn off the porch light Dimmer."]], "actions": ["Activate a scene"], "triggers": []}, "Xfinity": {"triggers": [], "flows": [["Homework Time", "WHEN every weekday at 5:30pm,\nONLY IF I am home...\n\nTHEN pause WiFi on my daughter’s iPad ,\nAND turn on her desk light...\n\nTHEN start timer for 1.5 hrs...\n\nTHEN turn desk light to green to indicate study home is done."], ["Movie Night", "WHEN I ask Amazon Alexa to run Movie Night...\n\nTHEN set brightness on my Livingroom light to 10%,\nAND pause my son’s iPad,\nAND change channel to STARZ kids & family."], ["Good Night", "WHEN every weekday at 8:30pm...\nONLY IF I am home\n\nTHEN fade off my son’s bedroom lights over 30 minutes,\nAND pause WiFi on his iPad for 8 hours to avoid late night browsing/gaming/watching."], ["Commute Summary", "WHEN time is 7:30 am every weekday,\nONLY IF I am home...\n\nTHEN get the travel time between home and work...\n\nTHEN show a notification on my X1 connected TV with traffic summary."], ["Dinner Time", "WHEN I press the Scene Button...\n\nTHEN pausing kid’s iPad for 1 hour,\nAND turn on my dining room light to 60% brightness."]], "actions": [], "name": "Xfinity"}, "Location": {"name": "Location", "flows": [["Leaving Home For Work", "WHEN I leave a Location area,\nONLY IF the Time is between two values...\n\nTHEN turn off my Hue Color Light."], ["Lights On When Coming Home", "Turn lights on when coming home in the evening\n\nWHEN I enter a Location area around my Home\nONLY IF the Time is after a 5:30pm...\n\nTHEN turn on my LIFX."], ["Rise And Shine", "Lights fade on in the morning\nWHEN it is sunrise,\nONLY IF I am at a Home...\n\nTHEN fade on my LIFX."], ["Headed Home", "Send your friend/family a notification that you have left work and will be home in xx mins\n\nWHEN I leave a Location area,\nONLY IF the Time is after a value...\n\nTHEN get the travel time between two addresses on Traffic...\n\nTHEN send my friend a push notification,\nAND send me a push notification on Notifications."], ["Work Hour Log", "Log your work hours to Google Calendar\n\nWHEN I enter or leave a Location area...\n\nTHEN create a new event on my Google Calendar."], ["Security Watch", "Set up a security watch when you are away\nWHEN motion is detected on my Arlo,\nONLY IF I am away from a Location ...\n\nTHEN record video with my Arlo...\n\nTHEN upload a file to my Dropbox,\nAND send me a push notification."], ["Lock Up", "Flow to lock the door and close the garage once your location is 1,000 feet away from home.\n\nHow it works:\n\nWHEN my Location shows me leaving an area...\n\nTHEN lock the Door Lock,\nAND close the Garage Door."]], "actions": [], "triggers": ["I enter an area", "I leave an area", "I enter or leave an area", "I am at a location", "I am away from a location"]}, "Carrier Côr": {"name": "Carrier Côr", "flows": [["1 Mile from Home", "Set Carrier Côr to home when you are 1 mile away.\n\nHow it works:\nWHEN I enter a Location 1 mile from home...\n\nTHEN set my Ecobee to Home,\nAND send me a push notification."], ["Away From Home", "Set your Carrier Côr to Away when you leave your home area.\n\nHow it works:\nWHEN I leave a Location area around my home...\n\nTHEN set my Ecobee to Away,\nAND send me a push notification."], ["Ecobee 70", "Set the temperature on your Carrier Côr by asking Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify 70\"...\n\nTHEN set the temperature on my Carrier Côr to 70."], ["Best Rest", "A simple button press lowers the Carrier Côr temp to 68 Fahrenheit and turns off the lights for a good night's sleep.\n\nHow it works:\nWHEN I press the Green Button...\n\nTHEN set the temperature on my Carrier Côr to 68 on cool mode,\nAND turn off my Zwave Light."], ["Heating Cost Saver", "Save money on heating costs by automatically lowering your Carrier Côr to 65F when the outside temp drops to 45F.\n\nHow it works:\nWHEN the temperature falls below 45 degrees Fahrenheit on Weather...\n\nTHEN set the heat temperature on my Carrier Côr to 65 degrees Fahrenheit,\nAND send me an Email."], ["AC Cost Saver", "Save money on your AC bill by automatically raising the Carrier Côr temp to 75F when the outside temp rises over 90F.\n\nHow it works:\nWHEN the temperature rises above 90 degrees Fahrenheit on Weather...\n\nTHEN set the cooling temperature on my Ecobee to 75 degrees Fahrenheit,\nAND send me an Email."]], "actions": ["Set temperature", "Set to home", "Set to away", "Resume program", "Turn on the fan"], "triggers": []}, "Email": {"name": "Email", "flows": [["Daily Weather Report", "Receive a weather report every morning at 6:30am.\n\nHow it works:\nWHEN the Date and Time is 6:30am...\n\nTHEN generate a weather report on Weather...\n\nTHEN send me an Email with the report."], ["Lunchtime Talk", "Every day at lunchtime, Email yourself a summary of what is trending on Twitter.\n\nHow it works:\nWHEN the Date and Time is noon...\n\nTHEN get what is trending on Twitter...\n\nTHEN send me an Email with the summary."], ["Morning Commute", "Email the latest traffic report between home and work at 7am every weekday morning.\n\nHow it works:\nWHEN the Date and Time is 7am on a weekday,\nONLY IF I am at my home Location...\n\nTHEN get the travel time between home and work on Traffic...\n\nTHEN send me an Email with the summary."], ["Evening Commute", "Email the latest traffic report between work and home at 5pm every weekday evening.\n\nHow it works:\nWHEN the Date and Time is 5pm on a weekday,\nONLY IF I am at my work Location...\n\nTHEN get the travel time between work and home on Traffic...\n\nTHEN send me an Email with the summary."], ["Smart Home News", "Email yourself the latest smart home news from CNET, Yahoo! and TechCrunch.\n\nHow it works:\nWHEN a new story is added based on the search \"smart home\" on Yahoo News...\n\nOR\n\nWHEN a new post is added based on the search \"smart home\" on CNET...\n\nOR\n\nWHEN a new story is added based on the search \"smart home\" on TechCrunch...\n\nTHEN send me an Email with the story."], ["Trip Details", "Send trip details from your Automatic enabled car to your Email.\n\nHow it works:\nWHEN my trip is finished in my Automatic enabled car...\n\nTHEN send me an Email with the details including location, fuel and distance."]], "actions": ["Send me an email"], "triggers": []}, "Amazon Alexa": {"name": "Amazon Alexa", "flows": [["Alexa, Tell Stringify 70", "Set your Nest temperature to 70 degrees via Amazon Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa, \"Alexa, tell Stringify 70\"...\n\nTHEN set the temperature on my Nest Thermostat to Heat/Cool 70."], ["Alexa and Hue Partying Together", "Use Alexa to turn on a party scene with multiple Philips Hue bulbs.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Party\"...\n\nTHEN turn on my Hue Bulb A19 to blue,\nAND turn on my Hue Bulb A19 to pink."], ["Timeout", "Give your 7 year old a 7 minute timeout with Alexa and LIFX.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Timeout\"...\n\nTHEN turn on my LIFX Color to red,\nAND set my Timer for 7 minutes...\n\nTHEN turn off my LIFX Color."], ["Movie Night with Alexa", "Have Alexa turn on the TV and Roku through Logitech Harmony and set your Z-Wave dimmers to 15%.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify movie night\"...\n\nTHEN start a movie night activity on my Logitech Harmony,\nAND Fade the Dimmer on to 15% brightness."], ["Alexa Good Morning", "Connect your morning with Alexa, Hue, Honeywell, Weather and Sonos via SmartThings.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Good Morning\"...\n\nTHEN generate a weather report on Weather,\nAND turn on my Hue Bulb A19,\nAND set the heating temperature on my Lyric...\n\nTHEN play the weather report on my Sonos connected via SmartThings."], ["Alexa Good Night", "Set your Nest temperature to 68 and turn off the light through Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Good Night\"...\n\nTHEN set the temperature on my Nest Thermostat to 68 Fahrenheit,\nAND turn off my light."]], "actions": [], "triggers": ["Ask Alexa to run a flow"]}, "Google Drive": {"name": "Google Drive", "flows": [["Who Rang The Bell?", "Keep a log of who rings your door bell when you are away from home\n\nWHEN my Ring Doorbell doorbell rings (with video),\nONLY IF I am away from a Location ...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Keep A Log Of Your Work Hours", "Log your work hours every weekday to see how much time you spend there\n\nWHEN I enter or leave my work area,\nONLY IF the Time is between two values on weekdays...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Back Up Your Shared Photos", "Back up photos and videos you share on Facebook and Instagram\n\nWHEN I create a new post on Facebook...\n\nTHEN upload a file to my Google Drive\nWHEN I post a new photo or video on Instagram...\n\nTHEN upload a file to my Google Drive"], ["Time At Home", "Keep a log of how much time you spend at home and away from home\n\nWHEN I enter or leave my home area...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Car Log", "Keep a log of your car to see trips driven, engine light on and speeding events\n\nWHEN the check engine light turns on in my Automatic enabled car...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive\nWHEN my trip is finished in my Automatic enabled car...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive\nWHEN speeding is detected in my Automatic enabled car...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."]], "actions": ["Upload a file", "Create a new text document", "Append to a text document", "Add row to a Google Sheets spreadsheet"], "triggers": ["New file in my Google Drive folder", "A file in my Google Drive folder is updated"]}, "Instagram": {"name": "Instagram", "flows": [["Insta Backup", "Save your Instagram photos and videos to Dropbox\n\nWHEN I post a new photo or video on Instagram...\n\nTHEN upload a file to my Dropbox."], ["Photo Post Machine", "Auto post photos on Twitter and Facebook\n\nWHEN I post a photo on Instagram...\n\nTHEN post it on Twitter as native photo\nAND upload to Facebook photo album."], ["Pictures Say 1000 Words", "Automatically repost your Instagram pics across Flickr and Facebook.\n\nHow it works:\n\nWHEN I post a picture to Instagram...\n\nTHEN post that image to Flickr with the hashtag,\nAND post that image to Facebook with the hashtag."], ["Insta Tweet", "Create photo tweet when you share a photo on Instagram\n\nWHEN I post a new photo or video on Instagram...\n\nTHEN tweet on Twitter."], ["Save To Box", "Save your Instagram photos and videos to Box automatically\n\nWHEN I post a new photo or video on Instagram...\n\nTHEN upload a file to my Box."]], "actions": [], "triggers": ["I post a new photo or video", "I post a new photo or video in an area"]}, "Twitch": {"triggers": ["A specific user's stream goes live", "A specific user's stream ends", "A specific user's stream is live", "A specific user's stream is offline", "A new game enters Top N"], "flows": [["Going LIVE!", "Turn your Hue purple when a specific user goes live on Twitch.\n\nHow it works:\nWHEN a specific User's Stream goes live...\n\nTHEN turn on my Hue Bulb A19 to purple,\nAND send me a push notification with the game and user info."], ["Top 10 Tracker", "Keep track of the Twitch Top 10 games in a Google Drive Sheet.\n\nHow it works:\nWHEN a new game enters the Top 10...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with all the info,\nAND send me a push notification."], ["Twitchify Friends", "Notify your Stringify Friend when a Twitch user goes live.\n\nHow it works:\nWHEN a specific user's stream goes live...\n\nTHEN send my friend a push notification with the info,\nAND send me a push notification as well."], ["Get Ready To Roll", "Turn on your TV and Roku to Twitch using your Logitech Harmony and blink your LIFX purple as a heads up when you are home and a Twitch user you follow comes online.\n\nHow it works:\nWHEN a specific user's stream goes live on Twitch,\nONLY IF I am at my home Location...\n\nTHEN blink my LIFX Color purple,\nAND start an activity on my Logitech Harmony to turn on my TV and Roku,\nAND send me a push notification with the information."], ["Streamer Post On Twitter", "Automatically post to Twitter when you go live on Twitch.\n\nHow it works:\nWHEN a specific user's stream goes live (yours)...\n\nTHEN tweet on Twitter your info, URL, etc."], ["Get Set", "Get ready to Twitch on the way home by turning on your Hue and receiving the Top 15 games on Twitch when you come home after 5pm on a weekday.\n\nHow it works:\nWHEN I enter my home Location area,\nONLY IF the Time is after 5pm on a weekday...\n\nTHEN get the Top 15 games on Twitch,\nAND turn on my Hue Bulb A19 to white...\n\nTHEN send me an Email."]], "actions": ["Get Top N games"], "name": "Twitch"}, "Craigslist": {"name": "Craigslist", "flows": [["Craig's Concert Tix", "Keep the latest concert tickets on Craigslist in an Evernote for weekend reference.\n\nHow it works:\nWHEN a new post is added to the search results for concert tickets on Craigslist...\n\nTHEN append the info to a note on Evernote,\nAND send me a push notification."], ["MacBook Pro Search", "Setup your Hue to help your search for a MacBook Pro on Craigslist.\n\nHow it works:\nWHEN a new post is added to the search results for \"MacBook Pro\" on Craigslist...\n\nTHEN turn on my Hue Bulb A19 to purple,\nAND send me an Email with the info."], ["Xmas Nutcracker Tracker", "Get ready for the holidays by feeding eBay and Craigslist nutcracker search results into a Google Drive Sheet.\n\nHow it works:\nWHEN there is a new post added to the nutcracker search results on eBay...\n\nOR\n\nWHEN a new post is added to the nutcracker search results on Craigslist...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the information."], ["Garage Sale Pro", "Receive any garage sale posts off Craigslist on the weekends.\n\nHow it works:\nWHEN a new post is added to the Garage Sales section on Craigslist,\nONLY IF the Time is between 5:30am and 6:00pm on the weekend...\n\nTHEN send me a push notification with the info."], ["Electronics DealNado", "Load CNET and Craigslist electronics deals into an Evernote.\n\nHow it works:\nWHEN a new post is added to the Deals feed on CNET...\n\nOR\n\nWHEN a new \"deal\" post is added to the electronics section on Craigslist...\n\nTHEN append to a note on Evernote."], ["XBox XAlert", "Send XBox alerts from Craigslist to your Email and blink your LIFX green if you are home.\n\nHow it works:\nWHEN a new post is added to the XBox search results on Craigslist,\n\nTHEN send me an Email with the info...\n\nAND ONLY IF I am at a Location (home)...\n\nTHEN blink my LIFX Color green."]], "actions": [], "triggers": ["New post added to search results"]}, "Foobot": {"name": "Foobot", "flows": [["Garage safety", "When VOC levels exceed a threshold in the garage, turn on a fan, open the garage door, and play a warning message.\n\nWHEN volatile Organic Compounds rises above on my Foobot...\n\nTHEN turn on my On/Off Switch,\nAND open the door using my Garageio,\nAND play a custom message on my Sonos."], ["Pollution alert", "If air pollution rises above a given threshold, flash my lights and send me a notification.\n\nWHEN air pollution rise above on my Foobot...\n\nTHEN blink my LIFX Color,\nAND send me a push notification."], ["Good night's sleep", "WHEN carbon Dioxide rises above on my Foobot...\nIf it is night time and carbon dioxide levels rise above a given threshold, then ventilate the room, turn on the lights, and play a warning message.\n\nTHEN turn the fan timer on or off on my Nest Thermostat,\nAND turn on my LIFX Color,\nAND play a custom message on my Sonos."], ["Don't sweat the small stuff", "If the humidity levels rise above a given threshold, then cool down with your thermostat.\n\nWHEN humidity rises above on my Foobot...\n\nTHEN cool down the temperature on my Nest Thermostat."], ["Allergy alert", "If particulate matter rises above a given threshold then send an allergy warning.\n\nWHEN particulate matter rises above on my Foobot...\n\nTHEN blink my LIFX Color,\nAND send me a push notification."], ["Cool down", "Use Foobot as an additional temperature sensor. If temperature rises above a given threshold, then cool down with your thermostat.\n\nWHEN temperature rises above on my Foobot...\n\nTHEN turn the fan timer on or off on my Nest Thermostat."]], "actions": [], "triggers": ["Temperature rises above", "Temperature falls below", "Particulate matter rises above", "Particulate matter drops below", "Humidity rises above", "Humidity drops below", "Carbon Dioxide rises above", "Carbon Dioxide drops below", "Volatile Organic Compounds rises above", "Volatile Organic Compounds drops below", "Air Pollution rises above", "Air Pollution drops below"]}, "Friends": {"name": "Friends", "flows": [["Honey, I'm Home", "Send a Notification to your Friend (spouse) when you get home.\n\nHow it works:\nWHEN I enter my home Location area...\n\nTHEN send my friend a push notification."], ["Share Your Goal", "WHEN my steps goal is achieved on my Fitbit...\n\nTHEN send my friend a push notification,\nAND send me a push notification."], ["Timekeeper", "Clock in at work automatically by sending the manager an email and saving the time to a Google Sheet.\n\nHow it works:\nWHEN I enter my work Location area...\n\nTHEN send my Friend / Mgr an email,\nAND add a row to a Google Sheets spreadsheet on my Google Drive with the time."], ["Daddy Is Almost Home", "Send a Notification to your spouse and give the kid(s) a heads up over Sonos connected via SmartThings that you are almost home and want some hugs.\n\nHow it works:\nWHEN I enter an area 1 mile away from my home Location...\n\nTHEN turn on my Hue Bulb A19 to green,\nAND send my Friend/Spouse a push notification,\nAND play a custom message on my Sonos connected via SmartThings that lets my kid(s) know I am almost home."], ["Headed Home", "Let your spouse know you are on your way and send the time it will take to get home from work automatically based on Traffic powered by Google.\n\nHow it works:\nWHEN I leave my work Location area,\nONLY IF the Time is after 5pm...\n\nTHEN get the travel time between work and home on Traffic...\n\nTHEN send my friend a push notification with the travel time,\nAND send me a push notification with the fastest route summary."], ["Closest Social Friends", "Automatically send your Friend an email when your post a pic to Instagram.\n\nHow it works:\nWHEN I post a new photo or video on Instagram...\n\nTHEN send my friend an email with the media."]], "actions": ["Send this friend an email", "Send this friend a push notification"], "triggers": []}, "Fitbit": {"name": "Fitbit", "flows": [["Fitness GOAL!", "Post Fitbit goal reached to Facebook & Google Drive.\n\nHow it works:\nWHEN I reach my goals on Fitbit…\n\nTHEN save the <Steps Goal> | <Steps> | <Steps goal achieved at> on my Google Drive,\nAND post on my Facebook that I achieved my <Steps goal> with the number of <Steps>,\nAND send me a Notification with the <Steps goal> and <Steps>."], ["Green = Goal", "Blink your LIFX lights green when you achieve your Fitbit goal.\n\nHow it works:\n\nWHEN I achieve my steps goal on Fitbit,\nAND my Location is home...\n\nTHEN blink my LIFX lights green to celebrate."], ["Mom's Check In", "It's smart to track pregnant mom's progress as her baby grows. Share weight info with husband and store in a Google Drive Sheet for the Dr.\n\nHow it works:\n\nWHEN there is a new weight logged on my Fitbit Aria...\n\nTHEN send me a Notification with the details,\nAND send my Friend (husband) a Notification with the same details,\nAND save the info to a Google Drive Sheet for future reference."], ["Tracking Off Your Goal", "Get a motivational notification when you are tracking off your goal\nWHEN my steps are below a value on my Fitbit...\n\nTHEN send me a push notification."], ["Sleep Log", "Log your sleep recorded on Fitbit to Google Sheet\nWHEN my sleep is logged on my Fitbit...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Fitbit Weight Log", "Log your weight to Google Sheet every time you weigh yourself\nWHEN my weight is logged on my Fitbit...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."]], "actions": [], "triggers": ["Step goal achieved", "Steps goal not achieved", "Steps above", "Steps below", "Distance goal achieved", "Calories burned goal achieved", "Floors climbed goal achieved", "Very active minutes goals achieved", "Sleep logged", "Sleep duration above", "Sleep duration below", "Weight logged"]}, "Honeywell Lyric": {"name": "Honeywell Lyric", "flows": [["Alexa 70", "Have Alexa set the heating temperature on your Honeywell Lyric to 70 degrees Fahrenheit.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify 70\"...\n\nTHEN set the heating temperature on my Lyric to 70 Fahrenheit."], ["Alexa 68", "Have Alexa set the cooling temperature on your Honeywell Lyric to 68 degrees Fahrenheit.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify 68\"...\n\nTHEN set the cooling temperature on my Lyric to 68 Fahrenheit."], ["Hot Outside, Circulate Inside", "Circulate air at home on your Honeywell Lyric when it's over 80F outside and you are away from home.\n\nHow it works:\nWHEN the temperature rises above 80F on Weather,\nONLY IF I am away from a Location ...\n\nTHEN set the fan mode on my Lyric to circulate."], ["Easy Wake Up", "Every weekday at 6:30am, slowly fade on your Philips Hue over 15 minutes and set the temperature on your Honeywell Lyric.\n\nHow it works:\nWHEN the Date and Time is 6:30am every weekday...\n\nTHEN set the heating temperature on my Lyric to 71F\nAND fade on my Hue Bulb A19 over 15 minutes."], ["Away = Off", "Turn my Honeywell Lyric off when my Mode is set to Away.\n\nHow it works:\nWHEN my Mode changes to Away...\n\nTHEN set the thermostat mode on my Lyric to off."], ["Save On Heating Costs", "Slowly lower the heating temperature on your Honeywell Lyric as the temperature outside drops.\n\nHow it works:\nWHEN the temperature falls below a value on Weather,\nONLY IF I am at a Location...\n\nTHEN Continue flow based on comparing numbers,\n\nTHEN set the heating temperature on my Lyric."], ["Leak!", "Turn your Hue blue when a leak is detected on your Honeywell Lyric Leak Detector.\n\nHow it works:\nWHEN my Leak Detector detects water...\n\nTHEN turn on my Hue Go to blue,\nAND send me an Email."], ["Plumber Appt.", "Set a Google Calendar appt to call a plumber when a leak is detected.\n\nHow it works:\nWHEN my Leak Detector detects water...\n\nTHEN create a new event on my Google Calendar,\nAND send me an Email."], ["Temp!", "Turn on your LIFX to yellow when an abnormal temperature is detected on your Honeywell Lyric Water Sensor.\n\nHow it works:\nWHEN my Leak Detector detects abnormal temperature...\n\nTHEN turn on my LIFX to yellow,\nAND send me an Email."], ["Auto Fan", "Turn on your fan via Honeywell Lyric when high humidity is detected.\n\nHow it works:\nWHEN my Leak Detector detects abnormal humidity...\n\nTHEN set the fan mode on my Lyric to On."], ["High Humidity", "Turn on my Z-Wave enabled fan for 1 hour when high humidity is detected on my Honeywell Lyric Leak Detector.\n\nHow it works:\nWHEN my Leak Detector detects abnormal humidity...\n\nTHEN turn on my Z-Wave On/Off switch,\nAND set a Timer for 1 hour...\n\nTHEN turn off my Z-Wave On/Off switch."], ["Temp Tweak", "When high temp is detected, for 30 minutes turn on a fan connected to you Wink Pivot Power Genius and your Hue to red.\n\n\nHow it works:\nWHEN my Leak Detector detects abnormal temperature...\n\nTHEN turn on my Hue Group to red,\nAND turn on my Wink Pivot Power Genius (with a fan connected to it),\nAND start my Timer for 30 minutes..\n\nTHEN turn off my Hue Group,\nAND turn off my Wink."]], "actions": [], "triggers": []}, "Functions: Text": {"name": "Functions: Text", "flows": [["Google Calendar Guests", "Pair this Flow with \"Guests Variable\". This Flow automatically sets your Guests Variable to True an hour before a Google Calendar event begins with \"guests\" in the title or description. Variable resets after 6 hours.\n\nHow it works:\nWHEN any event starts on my Google calendar...\n\nTHEN continue the Flow if the title or description contains \"guests\"...\n\nTHEN start my Timer for 6 hours,\nAND set Guests variable to True...\n\nTHEN set Guests variable to False."]], "actions": ["Continue the Flow if text contains", "Continue the Flow if text does not contain", "Continue the Flow if text equals", "Continue the Flow if text does not equal", "Replace text", "Extract a number from a string", "Convert text to upper case", "Convert text to lower case", "Continue the Flow if text matches a regular expression", "Extract regular expression groups", "Extract a substring from text"], "triggers": []}, "Reddit": {"name": "Reddit", "flows": [["Reddit Jokes", "Send yourself a Notification when there is a new top post in the Joke subreddit on Reddit.\n\nHow it works:\nWHEN a new hot post is added to the jokes subreddit on Reddit...\n\nTHEN send me a Notification with the joke."], ["Upvote Archive", "Save your Upvotes on Reddit to a Google Drive spreadsheet.\n\nHow it works:\nWHEN I upvote a post on Reddit...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the information."], ["NASA Updates", "Receive NASA updates in your inbox from Reddit, NASA and Yahoo.\n\nHow it works:\nWHEN there is a new item added to the NASA RSS Feed...\n\nOR\n\nWHEN a new story is added based on NASA search terms on Yahoo News...\n\nOR\n\nWHEN a new post is added to the NASA subreddit on Reddit...\n\nTHEN send me an Email with the content and URL."], ["Seasonal Wallpaper", "Save seasonal pics from Reddit to Dropbox.\n\nHow it works:\nWHEN a new post is added to the winterporn subreddit on Reddit...\n\nOR\n\nWHEN a new post is added to the springporn subreddit on Reddit...\n\nOR\n\nWHEN a new post is added to the summerporn subreddit on Reddit...\n\nOR\n\nWHEN a new post is added to the autumnporn subreddit on Reddit...\n\nTHEN upload the file to my Dropbox."], ["Robots", "Turn on your Hue green and receive a Notification when there is a new post in the shittyrobots subreddit on Reddit.\n\nHow it works:\nWHEN a new hot post is added to the shittyrobots subreddit on Reddit...\n\nTHEN turn on my Hue Bulb A19 to green,\nAND send me a push notification,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Hue Bulb A19."], ["Smarthome Subreddit", "Receive a Notification when there is a new post on the smarthome subreddit on Reddit.\n\nHow it works:\nWHEN a new post is added to the smarthome subreddit on Reddit...\n\nTHEN send me a push notification."]], "actions": [], "triggers": ["New post added to a subreddit", "New hot post in a subreddit", "New top post in a subreddit", "New post from search", "I create a new post", "I comment on a post", "I upvote a post", "I downvote a post", "I save a post"]}, "Insteon": {"name": "Insteon", "flows": [["Alexa Toggle", "Toggle your Insteon keypad with Amazon Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify toggle\"...\n\nTHEN toggle my Insteon keypad."], ["Trigger the House", "Leverage the IFTTT integration with Alexa by saying 'Alexa trigger the house' and turn off your Hue and Insteon lights. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN iFTTT Applet runs this Flow...\n\nTHEN turn off my Hue Bulb A19,\nAND turn off my Insteon keypad."], ["Motion", "Motion at Night? Turn on the light for 5 minutes...\n\nHow it works:\n\nWHEN there is a Motion detected,\nAND the Time is nighttime...\n\nTHEN turn on the Dimmer,\nAND set a Timer for 5 minutes...\n\nTHEN turn off the Dimmer."], ["Middle Of The Night Bathroom Break", "Turn on your light for 5 minutes at 15% brightness when there is a motion detected between 11pm and 6am.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF the Time is between 11pm and 6am...\n\nTHEN set brightness on my Dimmer Switch to 15%,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Sunset On", "Turn on your Insteon keypad at sunset.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN turn on my Insteon keypad."], ["Draft In Here", "When the door has been open for 5 minutes and you are at home, then turn off the Nest Thermostat and turn your Hue blue.\n\nHow it works:\nWHEN my Contact Sensor is open for 5 minutes,\nONLY IF I am at my home Location...\n\nTHEN turn off my Nest Thermostat,\nAND turn on my Hue Bulb A19 to blue."], ["Smart Alert", "Quick alarm system that turns on a light for 5 minutes and calls a phone number via IFTTT when your location is not at home and either a motion is detected or the door opens. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN my Open/Close Sensor opens,\n\nOR\n\nWHEN a new motion is detected on my Motions sensor...\n\nAND ONLY IF I am away from my home Location ...\n\nTHEN turn on my Dimmer Switch,\nAND run an IFTTT Applet to call a phone number...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["LEAK", "Create a Google Calendar appointment and flash your LIFX blue when a leak is detected by your a Water Sensor.\n\nHow it works:\nWHEN my Moisture Sensor detects water...\n\nTHEN create a new event on my Google Calendar,\nAND blink my LIFX Color blue for 1 minute,\nAND send me a push notification."]], "actions": ["Turn Scene On", "Turn Scene Off"], "triggers": []}, "Sengled": {"name": "Sengled", "flows": [["Sunset Fade On", "Fade on your White Light Bulb every day at sunset over 15 minutes.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN fade on my White Light Bulb."], ["Entry", "Turn on your White Light Bulb for 5 minutes at night when the door opens.\n\nHow it works:\nWHEN my Contact/Temperature/Motion Sensor opens,\nONLY IF it is nighttime...\n\nTHEN turn on my White Light Bulb,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my White Light Bulb."], ["Light The Way", "Don't stub your toe in the middle of the night by turning on your White Light Bulb at 15% brightness for 5 minutes.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF the Time is between 11pm and 5:30am...\n\nTHEN set brightness on my White Light Bulb to 15%,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my White Light Bulb."], ["Nighttime Welcome", "Turn on your White Light Bulb after dark when you enter your home Location area.\n\nHow it works:\nWHEN I enter a my home Location area,\nONLY IF it is nighttime...\n\nTHEN turn on my White Light Bulb."], ["Morning Off", "Turn off HVAC and lights when you leave for work in the morning.\n\nHow it works:\nWHEN I leave my home Location area,\nONLY IF the Time is between 6am and 8am...\n\nTHEN turn off my White Light Bulb,\nAND turn off my Thermostat."], ["Night Movement", "Turn on your lights for 2 minutes when the Netgear Arlo Q detects motion at night.\n\nHow it works:\nWHEN new motion detected with your Netgear Arlo Q,\nONLY IF it is nighttime...\n\nTHEN turn on my White Light Bulb,\nAND set a Timer for 2 minutes...\n\nTHEN turn off my White Light Bulb."]], "actions": [], "triggers": []}, "Ecobee": {"name": "Ecobee", "flows": [["1 Mile from Home", "Set Ecobee to home when you are 1 mile away.\n\nHow it works:\nWHEN I enter a Location 1 mile from home...\n\nTHEN set my Ecobee to Home,\nAND send me a push notification."], ["Away From Home", "Set your Ecobee to Away when you leave your home area.\n\nHow it works:\nWHEN I leave a Location area around my home...\n\nTHEN set my Ecobee to Away,\nAND send me a push notification."], ["Ecobee 70", "Set the temperature on your Ecobee by asking Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify 70\"...\n\nTHEN set the temperature on my Ecobee to 70."], ["Best Rest", "A simple button press lowers the Ecobee temp to 68 Fahrenheit and turns off the lights for a good night's sleep.\n\nHow it works:\nWHEN I press the Green Button...\n\nTHEN set the temperature on my Ecobee to 68 on cool mode,\nAND turn off my Zwave Light."], ["Heating Cost Saver", "Save money on heating costs by automatically lowering your Ecobee to 65F when the outside temp drops to 45F.\n\nHow it works:\nWHEN the temperature falls below 45 degrees Fahrenheit on Weather...\n\nTHEN set the heat temperature on my Ecobee to 65 degrees Fahrenheit,\nAND send me an Email."], ["AC Cost Saver", "Save money on your AC bill by automatically raising the Ecobee temp to 75F when the outside temp rises over 90F.\n\nHow it works:\nWHEN the temperature rises above 90 degrees Fahrenheit on Weather...\n\nTHEN set the cooling temperature on my Ecobee to 75 degrees Fahrenheit,\nAND send me an Email."]], "actions": ["Set temperature", "Set to home", "Set to away", "Resume program", "Turn on the fan"], "triggers": []}, "Netgear Arlo Cameras": {"name": "Netgear Arlo Cameras", "flows": [["Arm When I Leave Home", "Automatically Arm your camera when leaving home and log it to Security Camera Log file on Google Sheets\n\nWHEN I leave a Location area...\n\nTHEN Arm my Arlo's base station\nWHEN My Arlo's base station is armed...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive,\nAND send me a push notification."], ["Disarm When I Come Home", "Disarm your Arlo when coming home and log it to Security Camera Log file on Google Sheets\n\nWHEN I enter a Location area...\n\nTHEN Disarm this camera's base station\nWHEN My Arlo's base station is disarmed...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive,\nAND send me a push notification."], ["Motion Detected", "Log every motion detected by your Arlo to Security Camera Log file on Google Sheets\n\nWHEN Motion is detected on my Arlo...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive,\nAND send me a push notification."], ["Unlimited Video Recordings", "Save recorded videos to your Google Drive for free\n\nWHEN New video on my Arlo is recorded...\n\nTHEN Upload a file to my Google Drive."], ["Baby's On The Move", "Get a gentle nudge when your baby wakes up at night\nWHEN New motion detected with your Netgear Arlo Q,\nONLY IF it is nighttime...\n\nTHEN turn on my LIFX Color to a color,\nAND send me a push notification."], ["Nighttime Watch", "Let Arlo keep a night time watch when you may be away from home\n\nWHEN Motion is detected on my Arlo,\nONLY IF I am away from a Location ,\nAND ONLY IF it is nighttime...\n\nTHEN turn on my Hue Color Light to a color,\nAND send me a push notification...\n\nTHEN start my Timer...\n\nTHEN turn off my Hue Color Light."]], "actions": [], "triggers": []}, "LIFX": {"name": "LIFX", "flows": [["Heavy Traffic", "Turn your LIFX orange and receive a Notification with a traffic report when it takes longer than 30 minutes to get to work during a weekday morning.\n\nHow it works:\nWHEN travel time to a destination is greater than 30 minutes on Traffic,\nONLY IF the Time is between 6am and 9am during the week...\n\nTHEN send me a push notification with the traffic summary,\nAND turn on my LIFX Color to orange."], ["Game Time", "Turn on your LIFX Z and Color to your team colors by asking Alexa. Currently set to red.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Game Time\"...\n\nTHEN turn on my LIFX Z to red,\nAND turn on my LIFX Color to red.."], ["Good Night", "Simple Flow to start sleep off right. Turns your LIFX on to 15% Amber at 11pm and slowly fades off over 7 minutes.\n\nHow it works:\n\nWHEN the Time is 11:00pm on a weekday...\n\nTHEN turn on my bedroom LIFX to 15% Amber...\n\nTHEN fade the bedroom LIFX off over 7 minutes."], ["Entry Lighting", "Turn on your LIFX White for 5 minutes at nighttime when the door opens.\n\nHow it works:\nWHEN my Contact/Temperature/Motion Sensor opens,\nONLY IF it is nighttime...\n\nTHEN turn on my LIFX white,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my LIFX white."], ["Timeout!", "Sometimes kids get out of hand...so set a 7 minute Timeout with Alexa and LIFX by saying \"Alexa, tell Stringify to run Kids Bedroom Timeout\".\n\nHow It Works:\nWHEN I say \"Alexa, tell Stringify to run Kids Bedroom Timeout\"...\n\nTHEN turn the kids bedroom LIFX On to red,\nAND set a Timer for 7 minutes...\n\nTHEN turn off the kids bedroom LIFX,\nAND set a Timer for 5 seconds...\n\nTHEN blink the LIFX green 20 times."], ["IR Arlo", "Record a video on your Netgear Arlo when the door opens and your LIFX+ turns on to full IR brightness.\n\nHow it works:\nWHEN my Contact/Temperature/Motion Sensor opens,\nONLY IF it is nighttime...\n\nTHEN set the infrared brightness on my LIFX + to 100%...\n\nTHEN record video with my Arlo...\n\nTHEN send me an Email."], ["Warm Welcome Home", "Receive a warm welcome home by setting your Nest to 68F heat and turning on your LIFX Z when you enter your home area.\n\nHow it works l:\nWHEN I enter my home Location area,\nONLY IF the Time is after 5pm...\n\nTHEN turn on my LIFX Z to warm white,\nAND set the temperature on my Nest Thermostat to 68F Heat."], ["Nest At Night", "Turn on the IR light on your LIFX+ for 2 minutes when your Nest Cam detects motion at night.\n\nHow it works:\nWHEN new motion is detected on my Nest Camera,\nONLY IF it is nighttime...\n\nTHEN set the infrared brightness on my LIFX + to 100%,\nAND start my Timer for 2 minutes...\n\nTHEN turn off my LIFX +."], ["Sunset Fade All On", "Fade on all your LIFX bulbs over 15 minutes at sunset.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN fade on my LIFX Group over 15 minutes."]], "actions": ["Turn on the light", "Turn off the light", "Turn on to a color", "Set brightness", "Blink the light", "Blink the light for a duration", "Fade the light on", "Fade the light on to a color", "Fade the light off", "Toggle the light", "Color fade", "Activate a scene"], "triggers": []}, "Weather": {"triggers": ["Temperature rises above", "Temperature drops below", "Weather condition changes to", "UV index rises above", "Weather report is generated", "Temperature is above", "Temperature is below", "High temperature forecast will be above", "Low temperature forecast will be below", "Weather condition forecast will be", "UV index is above"], "flows": [["Rain Tomorrow", "Turn your Hue A19 light blue when tomorrow's forecast calls for rain.\n\nHow it works:\nWHEN the weather condition changes to rain tomorrow on Weather...\n\nTHEN turn on my Hue A19 light to blue."], ["Wake Up", "Orchestrate your morning through Alexa and have your Hue and WeMo (via IFTTT) turn on while also getting a weather report via Notification. Must be paired with the Stringify Wake Up applet on IFTTT.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Wake Up\"...\n\nTHEN run an IFTTT Applet,\nAND turn on my Hue Bulb A19,\nAND generate a weather report on Weather...\n\nTHEN send me a push notification with the weather report."], ["Alexa Good Morning", "Connect your morning with Alexa, Hue, Honeywell, Weather and Sonos via SmartThings.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Good Morning\"...\n\nTHEN generate a weather report on Weather,\nAND turn on my Hue Bulb A19,\nAND set the heating temperature on my Lyric...\n\nTHEN play the weather report on my Sonos connected via SmartThings."], ["Rain Delay", "Add a rain delay to you Rachio when there is rain predicted for tomorrow.\n\nHow it works:\nWHEN the weather condition changes to rain tomorrow on Weather...\n\nTHEN add a rain delay on my Rachio 16 Zones."], ["Auto Fan Based on Temps", "Automatically run your Nest fan when the temperature inside is higher than outside but both are over 70F.\n\nHow it works:\nWHEN the temperature rises above 70F on Weather,\nONLY IF the temperature is above 70F on my Nest Thermostat...\n\nTHEN continue the Flow if the Nest temperature is warmer than the outside Weather temperature...\n\nTHEN turn on the fan timer on my Nest Thermostat."], ["Save On Heating Costs", "Slowly increment your Nest temperature down by 2 degrees F as the outside temperature drops every 7 degrees F.\n\nHow it works:\nWHEN the temperature on Weather drops below 65F,\nAND my Location is home…\n\nTHEN compare the temperature as follows:\n\nbetween 70F and 50F THEN set my Heat to 70F\n\nOR between 49F and 44F THEN set my Heat to 68F\n\nOR between 43F and 37F THEN set my Heat to 66F\n\nOR between 36F and 30F THEN set my Heat to 64F\n\nOR between 29F and 23F THEN set my Heat to 62F\n\nOR less than 23F THEN set my Heat to 60F"]], "actions": ["Generate a weather report"], "name": "Weather"}, "Box": {"name": "Box", "flows": [["Update Alert", "Blink your lights when there is an update to your Box Files.\n\nHow it works:\nWHEN a new file is updated in my Box folder...\n\nTHEN blink my LIFX Color,\nAND send me an Email."], ["Power Archive", "Backup your Box files to Google Drive and Dropbox.\n\nHow it works:\n\nWHEN I upload a file to Box...\n\nTHEN upload the file to Google Drive,\nAND upload the file to Dropbox."], ["Archive CNN Travel", "Keep track of CNN Travel alerts by saving pics to Box and getting info via Notifications.\n\nHow it works:\nWHEN a new story is added to a section on CNN...\n\nTHEN upload a file to my Box,\nAND send me a push notification."], ["Slack Your Box Files", "Automatically post new files in Box to Slack.\n\nHow it works:\nWHEN a new file is in my Box folder...\n\nTHEN post a message to a channel on Slack,\nAND send me a push notification."], ["Watchful Eye", "Record and archive a video when the door opens and you aren't there.\n\nHow it works:\nWHEN my Contact/Temperature/Motion Sensor opens,\nONLY IF I am away from a Location ...\n\nTHEN record video on my Homeboy\nWHEN my Homeboy captures new video...\n\nTHEN upload a file to my Box,\nAND send me a push notification."], ["Office Doorbell Backup", "Backup your Ring videos to Box.\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings (with video)...\n\nTHEN upload a file to my Box,\nAND send me a push notification."]], "actions": ["Upload a file", "Create a text file"], "triggers": ["New file in my Box folder", "A file in a Box folder is updated"]}, "eBay": {"triggers": ["New post added to the search results"], "flows": [["eBaytification", "Send yourself a Notification when a new \"PlayStation\" item is posted on eBay.\n\nHow it works:\nWHEN there is a new post added to the \"PlayStation\" search results on eBay...\n\nTHEN send me a push notification with the info."], ["MacBook Pros on eBay", "Save eBay search results for MacBook Pros to a Google Sheet.\n\nHow it works:\nWHEN there is a new post added to the \"MacBook Pro 2016\" search results on eBay...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the info."], ["Strength in Numbers", "Grab Golden State Warriors gear on eBay and alert yourself via Hue and Email.\n\nWHEN there is a new post added to the \"Golden State Warriors\" search results on eBay...\n\nTHEN turn on my Hue Bulb A19 to blue,\nAND send me an Email...\n\nTHEN fade off my Hue Bulb A19 over 1 minute."], ["Nest Thermostat Search", "Find deals and info about Nest thermostats on eBay and CNET automatically.\n\nHow it works:\nWHEN a new post is added based on \"Nest thermostat\" search terms on CNET...\n\nOR\n\nWHEN there is a new post added to the \"Nest thermostat\" search results on eBay...\n\nTHEN send me an Email with the info."], ["Xmas Nutcracker Tracker", "Get ready for the holidays by feeding eBay and Craigslist nutcracker search results into a Google Drive Sheet.\n\nHow it works:\nWHEN there is a new post added to the nutcracker search results on eBay...\n\nOR\n\nWHEN a new post is added to the nutcracker search results on Craigslist...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the information."], ["Shopping Notes", "Keep an eBay shopping list in Evernote for Ford wheels.\n\nHow it works:\nWHEN there is a new post added to the \"Ford wheels\" search results on eBay...\n\nTHEN append to a note on Evernote with the info,\nAND send me a push notification."], ["Xmas Nutcracker Tracker", "Get ready for the holidays by feeding eBay and Craigslist nutcracker search results into a Google Drive Sheet.\n\nHow it works:\nWHEN there is a new post added to the nutcracker search results on eBay...\n\nOR\n\nWHEN a new post is added to the nutcracker search results on Craigslist...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the information."]], "actions": [], "name": "eBay"}, "Logitech Harmony": {"name": "Logitech Harmony", "flows": [["Morning Wake Up", "Wake up every weekday morning at 6:30am to Hue fading on and Logitech Harmony turning on the TV.\n\nHow it works:\nWHEN the Date and Time is 7am...\n\nTHEN fade on my Hue Bulb A19,\nAND start the Turn TV On activity on my Logitech Harmony."], ["Movie Night", "Settle into movie night by asking Alexa, and having your Hue turn on dimly and Logitech Harmony turn on your TV to the movie activity.\n\nHow it works:\nWHEN I say to Amazon's Alexa \"Alexa, tell Stringify Movie Night\"...\n\nTHEN turn on my Hue Bulb A19 to warm white at 15% brightness,\nAND start the Movie activity on my Logitech Harmony."], ["Cocktails", "Set the mood for cocktails by pressing the button and turning your LIFX bulbs to warm white at 60% brightness and having Logitech Harmony start your cocktails music activity.\n\nHow it works:\nWHEN I press the Purple Button...\n\nTHEN start the Cocktails activity on my Logitech Harmony,\nAND turn on my LIFX Color to warm white at 60% brightness."], ["Party Mode", "Have Alexa run \"Party Mode\" and let Logitech Harmony handle the music and Hue handle the lighting.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Party Mode\"...\n\nTHEN start the Party Playlist activity on my Logitech Harmony,\nAND turn on my Hue Bulb A19 to blue,\nAND turn on my Hue Bulb A19 to pink."], ["Musical Welcome", "Get welcomed home by music on weekend evenings.\n\nHow it works:\nWHEN I enter my home Location area,\nONLY IF the Time is after 6pm on the weekend...\n\nTHEN start a music activity on my Logitech Harmony."], ["Kids Entertainment Timer", "Set a 2 hour Timer for the kids in front of the TV / X-Box / PlayStation using Alexa, Logitech Harmony and a LIFX bulb.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Kids Time\"...\n\nTHEN start my Timer for 1 hour, 50 minutes,\nAND start the kids entertainment activity on my Logitech Harmony,\nAND turn on my LIFX Color to green...\n\nTHEN start another Timer for 10 minutes,\nAND turn on my LIFX Color to yellow as a warning...\n\nTHEN turn off my LIFX Color,\nAND stop the kids entertainment activity on my Logitech Harmony."]], "actions": ["Start an activity", "Stop an activity", "Turn off all activities"], "triggers": []}, "Functions: Math": {"name": "Functions: Math", "flows": [["Smartest Fan Ever", "Save a ton of money on your AC costs by running your Nest fan instead. Flow compares the temperature inside vs outside and will run the fan if the it's cooler outside and your inside temperature is hotter than 70F.\n\nHow it works:\nWHEN the Time is midnight and then repeating every hour,\nONLY IF the temperature is above 70F on my Nest Thermostat,\nAND ONLY IF the temperature is less than 100F outside on Weather...\n\nTHEN continue Flow based on comparing inside vs. outside temperature...\n\nTHEN turn the fan timer on or off on my Nest Thermostat."], ["Hue Weather Report", "At 7:15am set your Hue to orange, green, light blue or ice blue based on the temperature outside.\n\nHow it works:\nWHEN the Date and Time is 7:15am,\nONLY IF the high temperature forecast will be above 0F on Weather...\n\nTHEN continue Flow if today's temperature will be above 80F...\n\nTHEN turn on my Hue Bulb A19 to orange...\n\nTHEN continue Flow if today's temperature will be between 65F and 80F...\n\nTHEN turn on my Hue Bulb A19 to green...\n\nTHEN continue Flow if today's temperature will be between 45F and 65F...\n\nTHEN turn on my Hue Bulb A19 to light blue...\n\nTHEN continue Flow if today's temperature will be below 45F...\n\nTHEN turn on my Hue Bulb A19 to icey blue..."], ["Heating Cost Savings", "Slowly increment your Honeywell TCC Thermostat temperature down by 2 degrees F as the outside temperature drops every 7 degrees F.\n\nHow it works:\nWHEN the temperature on Weather drops below 65F,\nAND my Location is home…\n\nTHEN compare the temperature as follows:\n\nbetween 70F and 50F THEN set my Heat to 70F\n\nOR between 49F and 44F THEN set my Heat to 68F\n\nOR between 43F and 37F THEN set my Heat to 66F\n\nOR between 36F and 30F THEN set my Heat to 64F\n\nOR between 29F and 23F THEN set my Heat to 62F\n\nOR less than 23F THEN set my Heat to 60F."], ["Auto Fan Based on Temps", "Automatically run your Nest fan when the temperature inside is higher than outside but both are over 70F.\n\nHow it works:\nWHEN the temperature rises above 70F on Weather,\nONLY IF the temperature is above 70F on my Nest Thermostat...\n\nTHEN continue the Flow if the Nest temperature is warmer than the outside Weather temperature...\n\nTHEN turn on the fan timer on my Nest Thermostat."], ["Cool Night's Sleep", "Turn on your WeMo (with a fan plugged in) via IFTTT when the Temperature on your Netatmo is in between 70F and 85F between 9pm and 7am.\n\nHow it works:\nWHEN the temperature rises above 0F on my Netatmo indoor weather station,\nONLY IF I am at my home Location,\nAND ONLY IF the Time is between 9pm and 7am...\n\nTHEN continue Flow if the temperature is between 70F and 85F...\n\nTHEN run an IFTTT Applet to turn on my WeMo."], ["Save On Heating Costs", "Slowly increment your Nest temperature down by 2 degrees F as the outside temperature drops every 7 degrees F.\n\nHow it works:\nWHEN the temperature on Weather drops below 65F,\nAND my Location is home…\n\nTHEN compare the temperature as follows:\n\nbetween 70F and 50F THEN set my Heat to 70F\n\nOR between 49F and 44F THEN set my Heat to 68F\n\nOR between 43F and 37F THEN set my Heat to 66F\n\nOR between 36F and 30F THEN set my Heat to 64F\n\nOR between 29F and 23F THEN set my Heat to 62F\n\nOR less than 23F THEN set my Heat to 60F"]], "actions": ["Continue flow based on comparing numbers", "Perform math operations on two values"], "triggers": []}, "Automatic": {"name": "Automatic", "flows": [["Automatically Log Your Miles", "Automatically log your miles to see the patterns or add up for deductions.\n\nWHEN my trip is finished in my Automatic enabled car,\nONLY IF the Time is between 6am and 11pm during weekdays...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Check Engine Light On", "Get the engine light checked out\n\nWHEN my check engine lights turn on...\n\nTHEN send me a notification with the diagnostic code and description\nAND add it to my Google Sheet to track it\nAND add an appointment on my Google Calendar as a reminder."], ["Morning Commute", "Fastest route to work right when you start your car\n\nWHEN the ignition turns on in my Automatic enabled car,\nONLY IF the Time is between 7:30 am and 9:00 am...\n\nTHEN get the travel time between two addresses on Traffic...\n\nTHEN send me a push notification."], ["Headed Home", "Turning on the ignition after work sends notifications to yourself and your spouse for arrival times.\n\nHow it works:\n\nWHEN the ignition is started in my Automatic enabled car,\nAND the Time is after 5 pm...\n\nTHEN generate a Google Traffic report between work and home...\n\nTHEN send me a Notification with the fastest route info,\nAND send my Friend a Notification with the time it will take."], ["Auto Open", "Automatically open the garage when coming home\n\nWHEN I enter a Location area,\nONLY IF the ignition is on in my Automatic enabled car...\n\nTHEN open the door using my Garageio.\nAND ONLY IF the time is after 5:30pm,\n\nTHEN turn on my house lights"]], "actions": [], "triggers": ["Trip finished", "Ignition turns on", "Ignition turns off", "Check engine light turns on", "Check engine light turns off", "Speeding Detected", "Hard Acceleration Detected", "Ignition is on", "Ignition is off", "Check engine light is on", "Vehicle enters an area", "Vehicle exits an area"]}, "IFTTT": {"name": "IFTTT", "flows": [["Wake Up", "Orchestrate your morning through Alexa and have your Hue and WeMo (via IFTTT) turn on while also getting a weather report via Notification. Must be paired with the Stringify Wake Up applet on IFTTT.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Wake Up\"...\n\nTHEN run an IFTTT Applet,\nAND turn on my Hue Bulb A19,\nAND generate a weather report on Weather...\n\nTHEN send me a push notification with the weather report."], ["Good Night", "Get a good night's sleep when your WeMo (via IFTTT) turns off after 10pm and then see your Hue fade off over 10 minutes, your Nest set to 68F and your Netgear Arlo cameras armed.\n\nHow it works:\nWHEN an iFTTT Applet runs this Flow...\n\nTHEN set the temperature on my Nest Thermostat to 68F,\nAND fade off my Hue Bulb A19 over 10 minutes,,\nAND arm my Arlo's base station."], ["Party All The Time", "Get it going when you are at home and tap the button by starting both a music activity on your Logitech Harmony and a color loop on your Hue connected via IFTTT. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN I press the Button,\nONLY IF I am at my home Location...\n\nTHEN start a music activity on my Logitech Harmony,\nAND run an IFTTT Applet called Party All The Time."], ["Trigger the House", "Leverage the IFTTT integration with Alexa by saying 'Alexa trigger the house' and turn off your Hue and Insteon lights. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN iFTTT Applet runs this Flow...\n\nTHEN turn off my Hue Bulb A19,\nAND turn off my Insteon keypad."], ["Movie Night", "Set the movie night mood by asking Google Home via IFTTT to run the movie activity on Logitech Harmony to turn on your TV, amp and Roku and set the Hue to warm white at 15% brightness. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN IFTTT Applet runs this Flow...\n\nTHEN start the movie activity on my Logitech Harmony,\nAND turn on my Hue Bulb A19 to warm white at 15% brightness."], ["Smart Alert", "Quick alarm system that turns on a light for 5 minutes and calls a phone number via IFTTT when your location is not at home and either a motion is detected or the door opens. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN my Open/Close Sensor opens,\n\nOR\n\nWHEN a new motion is detected on my Motions sensor...\n\nAND ONLY IF I am away from my home Location ...\n\nTHEN turn on my Dimmer Switch,\nAND run an IFTTT Applet to call a phone number...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Headed Home", "Give everyone the heads up that you are headed home by sending a Notification to family, and using IFTTT to send an SMS and display a notification on your Comcast connected TV.\n\nHow it works:\nWHEN I leave my work Location area,\nONLY IF the Time is after 5pm on a weekday...\n\nTHEN run an IFTTT Applet to send an SMS and display a notification on my Comcast connected TV,\nAND send my friend a push notification."], ["Leaving For Work", "Arm the house and turn off the WeMo lights using IFTTT when you leave for work in the morning. Must be used with the IFTTT applet.\n\nHow it works:\nWHEN I leave my home Location area,\nONLY IF the Time is between 7:30am and 9:30am...\n\nTHEN run an IFTTT Applet."]], "actions": ["Run an IFTTT Applet"], "triggers": ["IFTTT Applet runs this Flow"]}, "Hue Bridge": {"name": "Hue Bridge", "flows": [["Welcome Home", "Automatically turn on your Hue lights at night when you arrive home.\n\nHow it works:\nWHEN I enter my home Location area,\nONLY IF it is nighttime...\n\nTHEN turn on all my Hue Lights."], ["Rain Tomorrow", "Turn your Hue lights blue when tomorrow's forecast calls for rain.\n\nHow it works:\nWHEN the weather condition changes to rain tomorrow on Weather...\n\nTHEN turn on my Hue lights to blue."], ["Sunset Fade On", "Slowly fade on your Hue lights over 10 minutes at sunset.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN fade on my Hue Lights over 10 minutes."], ["Easy Morning", "Weekday alarm that fades on your Hue lights over 10 minutes and sets the Nest temperature.\n\nHow it works:\nWHEN the Date and Time is 6:39am on a weekday...\n\nTHEN fade on my Hue lights over 10 minutes,\nAND set the temperature on my Nest Thermostat to 72F."], ["Going to Sleep", "Drift off to sleep with Hue lighting by pressing a button.\n\nHow it works:\nWHEN I press the Button...\n\nTHEN turn on my Hue lights to amber at 15% brightness...\n\nTHEN fade off my Hue lights over 15 minutes."], ["UV Alert", "Turn your Hue lights purple when the UV index gets high.\n\nHow it works:\nWHEN the UV index rises above 7 on Weather...\n\nTHEN turn on my Hue Bridge to purple."]], "actions": ["Turn on the light", "Turn off the light", "Turn on to a color", "Set brightness", "Fade the light on", "Fade the light off", "Activate a scene", "Blink my light", "Fade on to a color"], "triggers": []}, "Gmail": {"name": "Gmail", "flows": [["Gmail Mode-to-Home", "Set your Mode to Home by emailing your Gmail account with a Home label. Great for connecting alarm system status to Stringify.\n\nHow it works:\nWHEN I receive an email with the label \"Home\"...\n\nTHEN change my Mode to Home."], ["GMail Mode-to-Away", "Set your Mode to Away by emailing your Gmail account with a Away label. Great for connecting alarm system status to Stringify.\n\nHow it works:\nWHEN I receive an email with the label \"Away\"...\n\nTHEN change my Mode to Away."], ["G-Notes", "Add a received Gmail to an Evernote automatically.\n\nHow it works:\nWHEN I receive a Gmail with a label...\n\nTHEN append to a note on Evernote and add the body of the Email."], ["Expense Filter", "Filter expense related Gmails and save them to a Google Drive Sheet.\n\nHow it works:\nWHEN I receive a Gmail with a label...\n\nTHEN continue the Flow if text contains\"Expense\"...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the text."], ["Gmail Alert", "Turn on your Hue to red when a Gmail with a label is received...then turn it off after 15 minutes.\n\nHow it works:\nWHEN I receive an email with a label...\n\nTHEN turn on my Hue Bulb A19 to red,\nAND start my Timer for 15 minutes...\n\nTHEN turn off my Hue Bulb A19."], ["Arm Arlo with Gmail", "Arm your Netgear Arlo and set your Mode to Away with you receive a Gmail labeled \"Away\". Great for syncing alarm systems with your personal cameras.\n\n\nHow it works:\nWHEN I receive an Gmail with an \"Away\" label...\n\nTHEN Arm my Arlo's base station,\nAND change my Mode to Away."]], "actions": ["Send an email"], "triggers": ["I receive an email with a label"]}, "Notifications": {"name": "Notifications", "flows": [["Daily Commute", "Let Hue alert you when traffic to work is backed up\n\nWHEN the traffic to work from home is backed up...\n\nTHEN turn the kitchen Hue to amber...\nAND send me a notification with fastest route to work."], ["Nighttime Watch", "Let Arlo watch your back at the nighttime\n\nWHEN motion is detected on my Arlo,\nONLY IF it is nighttime...\n\nTHEN turn on my Hue Color Light\nAND send me a push notification...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Hue Color Light."], ["Teammate", "Get notified when your friend joins a game on Steam via Notification and by turning your Hue dark blue.\n\nHow it works:\nWHEN a friend starts playing any game on Steam...\n\nTHEN turn on my Hue Bulb A19 to blue,\nAND send me a push notification with the name, game and time."], ["Empty House At Sunset", "Send me a Notification at sunset if my presence tag isn't home yet.\n\nHow it works:\nWHEN it is sunset,\nONLY IF my Presence Tag is away...\n\nTHEN send me a push notification."], ["Smoke Detected!", "Turn your Hue A19 to orange when the Nest Protect detects smoke.\n\nHow it works:\nWHEN my Nest Protect detects a smoke warning...\n\nTHEN turn on my Hue Bulb A19 to orange,\nAND send me a Notification with the info."], ["Close When Rainy", "Close the Garageio enabled garage door when it's rainy and send a Notification with the weather.\n\nHow it works:\nWHEN the weather condition changes to a value on Weather...\n\nTHEN close the door using my Garageio,\nAND send me a Notification."]], "actions": ["Send me a push notification"], "triggers": []}, "Evernote": {"name": "Evernote", "flows": [["Sleep Log", "Save you sleep logs from Fitbit into Evernote and send yourself a Notification.\n\nHow it works:\nWHEN my sleep is logged on my Fitbit...\n\nTHEN append to a note on Evernote with the info,\nAND send me a Notification with the info."], ["Like Notes", "Save your likes from Twitter, Tumblr and Facebook to Evernote.\n\nHow it works:\nWHEN I like a page on Facebook...\n\nOR\n\nWHEN I like a post on Tumblr...\n\nOR\n\nWHEN I like a tweet on Twitter...\n\nTHEN append a note and save the URL and info to Evernote."], ["Ever-y-Trip", "Save your trip info from Automatic to Evernote and send a Notification including where your car is parked.\n\nHow it works:\nWHEN my trip is finished in my Automatic enabled car...\n\nTHEN append to a note on Evernote with the relevant info,\nAND send me a push notification."], ["How To Note", "Keep a running Evernote of How To posts from CNET.\n\nHow it works:\nWHEN a new post is added to the How To feed on CNET...\n\nTHEN append to a note on Evernote."], ["LIFX Shopper", "Keep track of LIFX bulbs for sale on Craigslist and eBay in an Evernote.\n\nHow it works:\nWHEN a new post is added to the LIFX search results on Craigslist...\n\nOR\n\nWHEN there is a new post added to the LIFX search results on eBay...\n\nTHEN append to a note on Evernote with the info."], ["Foot Traffic", "Keep track of the door opening on Evernote.\n\nHow it works:\nWHEN my Contact/Temperature Sensor opens...\n\nTHEN append to a note on Evernote with the name and time."]], "actions": ["Create a note", "Append to a note"], "triggers": ["I create a new notebook"]}, "Yelp": {"triggers": ["New highest rated restaurant near me", "New most reviewed restaurant near me"], "flows": [["Happy Hour!", "Email yourself local happy hours from Yelp at the push of a button.\n\nHow It Works:\nWHEN I push the button...\n\nTHEN find happy hours in the area on Yelp...\n\nTHEN Email me the list."], ["Food!", "Receive a notification when there is a new highly rated restaurant on Yelp.\n\nHow it works:\nWHEN there is a new highest rated restaurant near me on Yelp...\n\nTHEN send me a push notification."], ["Cocktails and Food", "Every Thursday at 4pm, turn on your Hue and start a music activity on your Logitech Harmony and generate a restaurant list for after cocktails on Yelp.\n\nHow it works:\nWHEN the Date and Time is 4pm on a Thursday,\n\nTHEN start a music activity on my Logitech Harmony,\nAND turn on my Hue Bulb A19 to a warm white,\nAND find restaurants near me on Yelp...\n\nTHEN send me a push notification with the restaurants."], ["Coming In Hot", "Get the best happy hours in Yelp when you enter a location after 4pm and then send that bar list to your Friend and yourself.\n\nHow it works:\nWHEN I enter a Location area,\nONLY IF the Time is after 4pm...\n\nTHEN find happy hour near me on Yelp...\n\nTHEN send my friend a push notification with the bar list,\nAND send me a push notification as well."], ["Saturday Foodie", "Receive a weekly digest at 6am on Saturday with food updates from the New York Times and restaurant updates from Yelp.\n\nHow it works:\nWHEN there is a new top story in the Food section on New York Times...\n\nOR\n\nWHEN there is a new highest rated restaurant near me on Yelp...\n\nTHEN add it to my weekly digest that gets sent Saturday morning at 6am."], ["Thinking Of You", "Send notifications to your Friend when a new highly rated restaurant is posted on Yelp.\n\nHow it works:\nWHEN there is a new highest rated restaurant near me on Yelp...\n\nTHEN send my friend a push notification with the info,\nAND send me a push notification as well."]], "actions": ["Find restaurants near me", "Find happy hour near me", "Find restaurants that serve brunch near me"], "name": "Yelp"}, "Mode": {"name": "Mode", "flows": [["Mode Set Home", "Set your Mode to home when you arrive home.\n\nHow it works:\nWHEN I enter my home Location area...\n\nTHEN change my Mode to Home."], ["Mode Set Away", "Set your Mode to Away when you leave home.\n\nHow it works:\nWHEN I leave my home Location area...\n\nTHEN change my Mode to Away."], ["Arriving Home", "Set the Nest temperature and turn on the light when it's nighttime as you arrive home.\n\nHow it works:\nWHEN my Mode changes to Home...\n\nTHEN set the temperature on my Nest Thermostat to Heat/Cool 70F,\n\nAND ONLY IF it is nighttime...\n\nTHEN turn on my Dimmer Switch."], ["Vacation", "Have your lights automatically turn on at sunset and turn off at 11:30 when you are away from home.\n\nHow it works:\nWHEN it is sunset,\nONLY IF my Mode is Away...\n\nTHEN turn on my Dimmer Switch.\n\nAND WHEN the Date and Time is 11:30pm,\nONLY IF my Mode is Away...\n\nTHEN turn off my Dimmer Switch."], ["Sleep Walker", "Give yourself a little light when walking around during sleep time.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF my Mode is Asleep...\n\nTHEN set brightness on my Dimmer Switch to 20%,\nAND start my Timer for 10 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Easy Sleepy", "Use LIFX to start sleep off right by setting to 15% amber and fading off over 15 minutes.\n\nHow it works:\nWHEN my Mode changes to Asleep...\n\nTHEN turn on my LIFX Color to 15% amber...\n\nTHEN fade off my LIFX Color over 15 minutes."], ["Mode Set Away", "Set your Mode to Away when you leave home.\n\nHow it works:\nWHEN I leave my home Location area...\n\nTHEN change my Mode to Away."]], "actions": ["Change my mode to..."], "triggers": ["Mode changes to...", "My mode is..."]}, "Skybell HD": {"name": "Skybell HD", "flows": [["Sky - Light", "Turn on your Hue Color Light for 5 minutes when someone rings your Skybell doorbell.\n\nHow it works:\nWHEN my Skybell HD doorbell rings...\n\nTHEN turn on my Hue Color Light,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Hue Color Light."], ["Doorbell Bark", "Play a dog bark sound and turn on your Hue Lux for 5 minutes when someone rings your SkyBell doorbell.\n\nHow it works:\nWHEN my Skybell HD doorbell rings...\n\nTHEN turn on my Hue Lux,\nAND play a dog bark sound on my Sonos connected via SmartThings,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Hue Lux."], ["Do Not Disturb", "Turn on your do not disturb feature on your Skybell at 10:30pm when you are home.\n\nHow it works:\nWHEN the Date and Time is 10:30pm,\nONLY IF I am at my home Location...\n\nTHEN turn on Do Not Disturb on my Skybell HD."], ["Disturb Me", "Turn off the do not disturb feature on your Skybell at 7:30am.\n\nHow it works:\nWHEN the Date and Time is 7:30am...\n\nTHEN turn off Do Not Disturb on my Skybell HD."], ["Nighttime Motion", "Turn on the spotlights for 2 minutes when your SkyBell detects motion at night.\n\nHow it works:\nWHEN my Skybell HD detects motion,\nONLY IF it is nighttime...\n\nTHEN turn on my On/Off Switch,\nAND start my Timer for 2 minutes...\n\nTHEN turn off my On/Off Switch."], ["Door Bell Extension", "Play a doorbell chime throughout the house when someone rings your Skybell doorbell.\n\nHow it works:\nWHEN my Skybell HD doorbell rings...\n\nTHEN play a doorbell chime on my Sonos connected via SmartThings,\nAND send me a Notification."]], "actions": ["Turn on Do Not Disturb", "Turn off Do Not Disturb"], "triggers": ["Doorbell rang", "Motion detected", "Doorbell rang (with photo)", "Motion detected (with photo)"]}, "RSS Feed": {"name": "RSS Feed", "flows": [["Interesting Thing Of The Day", "Receive an Email with new post from the Interesting Thing Of The Day RSS feed.\n\nHow it works:\nWHEN there is a new item added to the Interesting Thing Of The Day RSS Feed...\n\nTHEN send me an Email with the content."], ["Techie Stuff", "Receive a Notification when there is an update to the RSS Feeds for Mashable, Gizmodo and Lifehacker.\n\nHow it works:\nWHEN there is a new item added to the Mashable RSS Feed...\n\nOR\n\nWHEN there is a new item added to the Lifehacker RSS Feed...\n\nOR\n\nWHEN there is a new item added to the Gizmodo RSS Feed...\n\nTHEN send me a push notification."], ["Morning Business Update", "Send yourself a daily email at 7:00am with business updates from Reuters and The New York Times.\n\nHow it works:\nWHEN there is a new item added to the Business section of the Reuters RSS Feed...\n\nOR\n\nWHEN there is a new top story in the business section on New York Times...\n\nTHEN send me a daily Email at 7:00am."], ["Weekly Recipes", "Send a weekly email filled with recipes from Simply Recipes.\n\nHow it works:\nWHEN there is a new item added to the Simply Recipes RSS Feed...\n\nTHEN add it to my weekly digest Email."], ["Weekly Politics", "WHEN a new story is added to the politics section on Yahoo News...\n\nOR\n\nWHEN there is a new item added to the Reuters Politics RSS Feed...\n\nTHEN add it to my weekly email digest."], ["Smarthome Digest", "Add smarthome news from Yahoo, CNET and Lifehacker to a weekly Email.\n\nHow it works:\nWHEN a new smarthome story is added on Yahoo News...\n\nOR\n\nWHEN there is a new smarthome article on the Lifehacker RSS Feed...\n\nOR\n\nWHEN a new smarthome post is added on CNET...\n\nTHEN add it to my weekly digest Email."]], "actions": [], "triggers": ["New item added to the feed", "New item that matches search term, is added to the feed"]}, "Connect: Maker": {"name": "Connect: Maker", "flows": [["Meet Your Maker", "Send an HTTP POST from Maker using Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa tell Stringify Maker\"...\n\nTHEN send an HTTP POST from my Maker."], ["Tap to PUT", "Send an HTTP PUT from Maker by tapping the Button.\n\nHow it works:\nWHEN I press the Green Button...\n\nTHEN send an HTTP PUT from my Maker."], ["Sunset", "Send an HTTP POST from Maker at sunset when you are home.\n\nHow it works:\nWHEN it is sunset,\nONLY IF I am at a Location...\n\nTHEN send an HTTP POST from my Maker."], ["Q Video", "Record a video on my Netgear Arlo Q when Maker sends an HTTPS POST.\n\nHow it works:\nWHEN my Maker sends Stringify an HTTPS POST...\n\nTHEN record video...\n\nTHEN send me an Email."], ["GET", "Have Alexa trigger an HTTP GET from Maker and send to Email.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa tell Stringify Get\"...\n\nTHEN send an HTTP GET from my Maker...\n\nTHEN send me an Email with the code."], ["Homemaker", "Turn on your Hue A19 and send an HTTP POST via Maker when you come home after dark.\n\nHow it works:\nWHEN I enter my home Location area,\nONLY IF it is nighttime...\n\nTHEN send an HTTP POST from my Maker,\nAND turn on my Hue Bulb A19."]], "actions": ["Send an HTTP GET", "Send an HTTP POST", "Send an HTTP PUT"], "triggers": ["Send Stringify an HTTP GET/POST"]}, "Rainforest EAGLE": {"name": "Rainforest EAGLE", "flows": [["Save Some Cash", "Reduce your energy costs by turning off your Nest Thermostat when your Rainforest Eagle indicates energy prices are rising.\n\nHow it works:\nWHEN price rises above 20 cents / kilowatt hour...\n\nTHEN turn off my Nest Thermostat."], ["Wattage Warning", "Warm yourself at home when energy usage is spiking by blinking your LIFX lights and receiving a notification.\n\nHow it works:\nWHEN usage rises above 3000 Watts,\nONLY IF I am at my home Location...\n\nTHEN blink my LIFX Group green 25 times,\nAND send me a push notification."], ["Utility Message", "Receive an Email when there is a new message from your utility via Rainforest Eagle.\n\nHow it works:\nWHEN a new message is received from a utility through my Rainforest Eagle...\n\nTHEN send me an Email."], ["Under 2K", "Send a Notification when your usage falls below 2000 Watts on your Rainforest Eagle.\n\nHow it works:\nWHEN usage falls below 2000 Watts on my Rainforest Eagle...\n\nTHEN send me a push notification."], ["5000 Watt Shutdown", "Shut a few things down when your power usage on Rainforest Eagle rises above 5000 Watts including your Honeywell TCC Thermostat, Dimmer and On/Off switch.\n\nHow it works:\nWHEN usage rises above 5000 Watts...\n\nTHEN turn off my On/Off Switch,\nAND set the thermostat mode to OFF on my Honeywell TCC,\nAND turn off my Dimmer Switch."], ["Energy Giver", "Give back to the grid and let yourself know by turning on your Hue to green and sending a Notification when your energy usage on your Rainforest Eagle drops below 0 Watts.\n\nHow it works:\nWHEN usage falls below 0 Watts on my Rainforest Eagle...\n\nTHEN turn on my Hue Bulb A19 to green at 50% brightness,\nAND send me a push notification."]], "actions": [], "triggers": ["Usage rises above", "Price rises above", "Usage falls below", "Price falls below", "Usage is above", "Price is above", "Usage is below", "Price is below", "New message received from utility"]}, "Google Calendar": {"name": "Google Calendar", "flows": [["Birthday Reminder", "Never miss a friend's or family's birthday again\n\nWHEN any event starts on my Google calendar with word Birthday...\n\nTHEN send me a push notification."], ["Weather In Your Calendar", "Let your calendar bring you weather summary every morning\n\nWHEN a weather report is generated on Weather...\n\nTHEN create a new event on my Google Calendar."], ["Time To Visit Mechanic", "Add the details of Check Engine Light code to your calendar\n\nWHEN the check engine light turns on in my Automatic enabled car...\n\nTHEN create a new event on my Google Calendar...\n\nTHEN send me a push notification."], ["Punch Card", "Track my work day via Google Calendar.\n\nHow It Works:\nWHEN I enter an area...\n\nTHEN add the date, time and location to my Google Calendar."], ["Family Calendar", "Automatically add Facebook RSVPs to Google Calendar & message the family.\n\nHow it works:\nWHEN I am going to an event on Facebook…\n\nTHEN set an appointment in my Google Calendar with the event name, date, start time and its URL...\nAND send a Notification to my Stringify Friend with the event info."]], "actions": ["Create a new event", "Get my next event"], "triggers": ["New event is added to my calendar", "Any event changes", "Any event starts"]}, "Jawbone UP": {"name": "Jawbone UP", "flows": [["Fitness GOAL!", "Post your Jawbone steps onto Facebook and Google Drive when you achieve your goal.\n\nHow it works:\nWHEN my steps goal is achieved on my Jawbone Up...\n\nTHEN create a post on Facebook,\nAND add a row to a Google Sheets spreadsheet on my Google Drive with the info,\nAND send me a push Notification."], ["Goal = Green", "When you are home and hit your steps goal on your Jawbone Up, then turn your Hue light green.\n\nHow it works:\nWHEN my steps goal is achieved on my Jawbone,\nONLY IF I am at my home Location...\n\nTHEN turn on my Hue Bulb A19 to green."], ["Sleep Log", "Automatically save your Jawbone Up sleep Log to a Google Drive Sheet.\n\nHow it works:\nWHEN new sleep is logged on my Jawbone...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the info."], ["Gentle Rest", "Set sleep mode using your Jawbone Up and slowly fade off your LIFX over 15 minutes.\n\nHow it works:\nWHEN I enter sleep mode on my Jawbone...\n\nTHEN turn on my LIFX Color to 15% amber,\nAND start my Timer for 5 minutes...\n\nTHEN fade off my LIFX Color over 10 minutes."], ["There's Still Time", "Quick reminder at 6pm when you haven't reached your goals on your Jawbone Up by turning in your Hue to orange and sending a Notification.\n\nHow it works:\nWHEN my steps goal is not achieved on my Jawbone by 6pm...\n\nTHEN turn on my Hue Bulb A19 to orange,\nAND send me a Notification with the info."], ["Cool Down", "Reduce the temperature on your Nest by 3 degrees when you finish your workout on your Jawbone Up and you are at home.\n\nHow it works:\nWHEN I exit activity mode on my Jawbone,\nAND my Location is home...\n\nTHEN cool down the temperature on my Nest Thermostat by 3 degrees."]], "actions": [], "triggers": ["Steps above", "Steps below", "Steps goal achieved", "Steps goal not achieved", "Enter sleep mode", "Exit sleep mode", "New sleep logged", "Sleep duration above", "Sleep duration below", "Sleep goal achieved", "Enter activity mode", "Exit activity mode", "New workout logged", "New meal logged", "New mood logged", "Awake", "Sleeping"]}, "August Smart Lock": {"name": "August Smart Lock", "flows": [["Door Lock Status", "Get the door lock status by saying \"Alexa, ask Stringify is my door locked\"\n\nWHEN ask Alexa to run a Flow,\nONLY IF my August Lock is locked...\n\nTHEN send me a push notification with the lock status\n\nWHEN ask Google to run a Flow,\nONLY IF my August Lock is unlocked...\n\nTHEN send me a push notification with the lock status."], ["Welcome Home", "When you unlock your August door lock after 6:00pm, turn on the lights automatically.\n\nWHEN my August Lock unlocks,\nONLY IF the Time is after 6pm...\n\nTHEN turn on my Hue Color Light to a color,\nAND turn on my Hue Color Light to a color."], ["Lock Up", "Automatically lock up the door and turn off the house lights when leaving For work\n\nWHEN I leave a Location area around home,\nONLY IF the Time is between 7:30 am and 9:30 am...\n\nTHEN turn off my Hue Color Light,\nAND lock my Lock."], ["Door Lock Backup", "Never forget to lock the door again.\n\nWHEN I leave a Location area,\nONLY IF my Lock is unlocked...\n\nTHEN lock my Lock\nWHEN my Lock locks...\n\nTHEN start my Timer for 30 seconds,\nONLY IF my Lock is locked...\n\nTHEN send me a push notification with confirmation ."], ["Door Lock Log", "Keep a log of your door lock\n\nWHEN my Lock unlocks...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive\nWHEN my Lock locks...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive."], ["Safety Alert", "Receive a safety alert when someone unlocks the door while you are away from home\n\nWHEN my Lock unlocks,\nONLY IF I am away from home ...\n\nTHEN blink my LIFX Group,\nAND play a sound on my Sonos,\nAND send me a push notification."], ["Lock Up At Night", "Just say \"Alexa, tell Stringify Goodnight\"\n\nWHEN I ask Amazon Alexa to tell Stringify Goodnight...\n\nTHEN turn off my Hue Color Light,\nAND lock my Lock."]], "actions": ["Lock"], "triggers": ["Lock locks", "Lock unlocks", "Locked", "Unlocked"]}, "Date & Time": {"name": "Date & Time", "flows": [["7:00am Rooster", "Wake up at 7:00am to a rooster and your Hue fading on.\n\nHow it works:\nWHEN the Date and Time is 7:00am...\n\nTHEN play a rooster sound on my Sonos,\nAND fade on my Hue Bulb A19."], ["Sunset Fade On", "Fade your Hue on over 15 minutes every day at sunset.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN fade on my Hue Bulb A19 over 15 minutes."], ["Morning TV", "Every weekday morning you are home, have your TV turn on to the morning news using your Logitech Harmony.\n\nHow it works:\nWHEN the Date and Time is 7:00am on a weekday,\nONLY IF I am at my home Location...\n\nTHEN start the morning news activity on my Logitech Harmony."], ["Bedtime Alert", "Flash the lights red at 8:15 and again at 8:30 to remind kids to go to bed.\n\nHow it works:\nWHEN the Date and Time is 8:15...\n\nTHEN blink my LIFX Color red,\nAND start my Timer for 15 minutes...\n\nTHEN blink my LIFX Color red again."], ["Midnight Bathroom Break", "Turn on the light to 15% when motion is detected between 10pm and 6am.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF the Time is between 10:00pm and 6:00am...\n\nTHEN set brightness on my Zwave Light to 15%...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Zwave Light."], ["Lights On While You're Away", "Turn on your lights 1 hour after sunset when you aren't at home then turn them off a few hours later.\n\nHow it works:\nWHEN it is an hour after sunset,\nONLY IF my Location is not at home...\n\nTHEN turn on my light,\nAND set a Timer for 4 hours,\nAND send me a Notification...\n\nTHEN turn off the light,\nAND send me a Notification."]], "actions": [], "triggers": ["Date and time is:", "Time is between:", "Time is after:", "Sunrise", "Sunset", "It is daytime", "It is nighttime", "Random time between (beta):"]}, "Nest": {"name": "Nest", "flows": [["Get Your Nest Home Ready", "Have Nest set your home up before you arrive by getting info from Google Traffic when you leave work after 5pm.\n\nHow it works:\nWHEN I leave my work Location area,\nONLY IF the Time is after 5pm on a weekday...\n\nTHEN get the travel time between two addresses on Traffic...\n\nTHEN set ETA on my Nest home."], ["Home Hue", "Turn on my Hue lights when it's nighttime and my Nest changes to Home mode.\n\nHow it works:\nWHEN my Nest Home changes to Home mode,\nONLY IF it is nighttime...\n\nTHEN turn on my Hue Color Light."], ["Going Away", "WHEN my Nest Home changes to Away mode...\n\nTHEN arm my Arlo's base station."], ["Ring While I'm Away", "Turn on all your Hues when someone presses your Ring doorbell and you are away from your Nest home.\n\nHow it works:\nWHEN my Ring Doorbell doorbell rings,\nONLY IF my Nest Home status is Away...\n\nTHEN turn on my Hue Group,\nAND start my Timer for 15 minutes...\n\nTHEN turn off my Hue Group."], ["Needy Home", "Listen to a fun message from your home upon your return.\n\nHow it works:\nWHEN my Nest Home changes to Home mode...\n\nTHEN play a fun message on my Sonos connected via SmartThings."]], "actions": ["Set ETA"], "triggers": ["Home changes to Home mode", "Home changes to Away mode", "Home status is Home", "Home status is Away"]}, "Steam": {"name": "Steam", "flows": [["Teammate", "Get notified when your friend joins a game on Steam via Notification and by turning your Hue dark blue.\n\nHow it works:\nWHEN a friend starts playing any game on Steam...\n\nTHEN turn on my Hue Bulb A19 to blue,\nAND send me a push notification with the name, game and time."], ["Wingman", "Notify a buddy when you start playing a game on Steam.\n\nHow it works:\nWHEN I start playing a specific game on Steam...\n\nTHEN send my Friend a push notification asking them to join."], ["Gamer Tweet", "Tweet your followers on Twitter when you start playing a game on Steam.\n\nHow it works:\nWHEN I start playing any game on Steam...\n\nTHEN tweet on Twitter the game name."], ["Online Alert", "When you are on Steam and your Friend signs onto Steam, blink your LIFX green and receive a Notification.\n\nHow it works:\nWHEN my friend's status on Steam changes to online,\nONLY IF my status on Steam is online...\n\nTHEN blink my LIFX Color green 30 times,\nAND send me a push notification with their name and time."], ["Parent Timer For Gaming", "Set a 90 minute Timer when your child goes on Steam. Hue turns on to green, changes to yellow at 1:25 and red at 90 minutes when you also receive a Notification.\n\nHow it works:\nWHEN my status on Steam changes to online...\n\nTHEN turn on my Hue Bulb A19 to a color green,\nAND start my Timer for 1 hr, 25 mins...\n\nTHEN turn on my Hue Bulb A19 to a color yellow,\nAND start my Timer for 5 mins...\n\nTHEN turn on my Hue Bulb A19 to a color red,\nAND send me a push notification."], ["Thrones & Friends", "When you are home and join Game of Thrones on Steam (or another specific game), tell your Friend, set the scene with Sonos connected via SmartThings and Hue, and send yourself a Notification.\n\nHow it works:\nWHEN I start playing Game of Thrones on Steam,\nONLY IF I am at my home Location...\n\nTHEN turn on my Hue Bulb A19 to icy blue,\nAND send my friend a push notification, asking him to join\nAND play a custom message on my Sonos connected via SmartThings saying \"Game time. Winter is coming to Westeros.\"...\nAND send me a push notification."]], "actions": [], "triggers": ["My status changes to", "My friend's status changes to", "My status is", "My friend's status is", "I start playing a specific game", "I stop playing a specific game", "My friend starts playing a specific game", "My friend stops playing a specific game", "I start playing any game", "I stop playing any game", "A friend starts playing any game", "A friend stops playing any game"]}, "Honeywell Wi-Fi Thermostat": {"name": "Honeywell Wi-Fi Thermostat", "flows": [["Good Morning", "Run the whole show through Alexa - turn on lights, set temperature and send me notification on today's weather.\n\nHow it works:\nWHEN I say \"Alexa, tell Stringify Good Morning\"...\n\nTHEN turn on my LIFX to 80% white,\nAND set my Honeywell TCC thermostat to 70 degrees Fahrenheit,\nAND generate today weather report\nAND send me a notification with the report."], ["Cozy", "Keep warm and use your Relay to adjust Your Honeywell TCC Thermostat.\n\nHow it works:\nWHEN temperature falls below 68 F on my Wink Relay,\nONLY IF it is nighttime...\n\nTHEN set the temperature on my Honeywell TCC Thermostat to 70F."], ["5000 Watt Shutdown", "Shut a few things down when your power usage on Rainforest Eagle rises above 5000 Watts including your Honeywell TCC Thermostat, Dimmer and On/Off switch.\n\nHow it works:\nWHEN usage rises above 5000 Watts...\n\nTHEN turn off my On/Off Switch,\nAND set the thermostat mode to OFF on my Honeywell TCC,\nAND turn off my Dimmer Switch."], ["Night Night", "Cool down the bedroom and slowly turn off your Hue lights every night at 10:30pm if you are home.\n\nHow it works:\nWHEN the Date and Time is 10:30pm,\nONLY IF I am at my home Location...\n\nTHEN fade off my Hue Bulb A19 over 15 minutes,\nAND set the cooling temperature on my Honeywell TCC to 68F."], ["Heating Cost Savings", "Slowly increment your Honeywell TCC Thermostat temperature down by 2 degrees F as the outside temperature drops every 7 degrees F.\n\nHow it works:\nWHEN the temperature on Weather drops below 65F,\nAND my Location is home…\n\nTHEN compare the temperature as follows:\n\nbetween 70F and 50F THEN set my Heat to 70F\n\nOR between 49F and 44F THEN set my Heat to 68F\n\nOR between 43F and 37F THEN set my Heat to 66F\n\nOR between 36F and 30F THEN set my Heat to 64F\n\nOR between 29F and 23F THEN set my Heat to 62F\n\nOR less than 23F THEN set my Heat to 60F."], ["Not Home", "Set your Honeywell TCC thermostat to off when you are more than 2 miles away.\n\nHow it works:\nWHEN my Location leaves an area 2 miles from home,\nTHEN turn off my Honeywell TCC thermostat."]], "actions": ["Set thermostat mode", "Set heating temperature", "Set cooling temperature"], "triggers": ["When the temperature rises above", "When the temperature falls below", "When the temperature is above", "When the temperature is below"]}, "Yale Real Living": {"triggers": [], "flows": [["Look Battery Low", "WHEN my Yale Look battery is low...\n\nTHEN turn on my LIFX Color to a color,\nAND send me a push notification."], ["Whole Home Look Doorbell", "WHEN my Yale Look detects doorbell pressed...\n\nTHEN play a sound on my Connected Speaker."], ["Simple Look Motion", "WHEN my Yale Look detects motion,\nONLY IF it is nighttime...\n\nTHEN turn on my LIFX White,\nAND start my Timer...\n\nTHEN turn off my LIFX White."], ["Look Occupied Home", "WHEN my Yale Look detects motion,\nONLY IF I am away from a Location ...\n\nTHEN turn on my Hue Bulb A19,\nAND start an activity on my Logitech Harmony,\nAND start my Timer...\n\nTHEN stop an activity on my Logitech Harmony,\nAND turn off my Hue Bulb A19."], ["Look Door Blink", "WHEN my Yale Look detects doorbell pressed...\n\nTHEN blink my LIFX Color."]], "actions": [], "name": "Yale Real Living"}, "Yahoo News": {"triggers": ["New story is added to a section", "New story based on search terms", "New story for a company", "New story for your sports team"], "flows": [["Weekly Politics", "WHEN a new story is added to the politics section on Yahoo News...\n\nOR\n\nWHEN there is a new item added to the Reuters Politics RSS Feed...\n\nTHEN add it to my weekly email digest."], ["NASA Updates", "Receive NASA updates in your inbox from Reddit, NASA and Yahoo.\n\nHow it works:\nWHEN there is a new item added to the NASA RSS Feed...\n\nOR\n\nWHEN a new story is added based on NASA search terms on Yahoo News...\n\nOR\n\nWHEN a new post is added to the NASA subreddit on Reddit...\n\nTHEN send me an Email with the content and URL."], ["Super Fan", "Get the latest sports articles on Yahoo and The New York Times in your inbox.\n\nHow it works:\nWHEN a new story is added to the sports section on Yahoo News...\n\nOR\n\nWHEN there is a new top story in a section on New York Times...\n\nTHEN send me an Email with the information."], ["Tech News", "Get the latest tech news from TechCrunch, Yahoo! News and CNN via push notifications.\n\nHow it works:\nWHEN a new story is added to the gadgets section on TechCrunch...\n\nOR\n\nWHEN a new story is added to the technology section on CNN...\n\nOR\n\nWHEN a new story is added to the technology section on Yahoo News...\n\nTHEN send me a push notification."], ["MMA", "Instantly receive MMA articles from Yahoo while blinking your LIFX red if you are home.\n\nHow it works:\nWHEN a new MMA story is added on Yahoo News...\n\nTHEN send me a push notification with the information,\n\nAND ONLY IF I am at a Location...\n\nTHEN blink my LIFX Color red 20 times."], ["Morning Sports Paper", "Receive the top 10 sports stories from Yahoo News every morning at 6am.\n\nHow it works:\nWHEN the Date and Time is 6am...\n\nTHEN generate a news summary of the top 10 sports stories on Yahoo News...\n\nTHEN send me an Email with the stories."]], "actions": ["Generate news summary"], "name": "Yahoo News"}, "Messages": {"name": "Messages", "flows": [], "actions": ["Send me a message", "Send a message to someone else"], "triggers": []}, "Misfit": {"name": "Misfit", "flows": [["Fitness GOAL!", "Celebrate when you meet your daily fitness goal\n\nWHEN my daily goal is achieved on my Misfit...\n\nTHEN create a post on Facebook,\nAND add a row to a Google Sheets spreadsheet on my Google Drive,\nAND send me a push notification."], ["One Last Push", "Get a gentle nudge when you are trending off your daily goal.\n\nWHEN my daily goal is not achieved on my Misfit by 7pm...\n\nTHEN send me a push notification encouraging to squeeze in a workout."], ["Daily Activity Summary", "Get a daily summary. Don't forget to sync your Misfit before you hit the bed\n\nWHEN An activity summary is generated on my Misfit at the end of the day...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive,\nAND send me a summary notification."], ["Sleep Tracker", "Ultimate sleep tracker\n\nWHEN my sleep duration is above 7 hours on my Misfit...\n\nTHEN append to a text document in my Google Drive\nWHEN my sleep duration is below 6 hours on my Misfit...\n\nTHEN append to a text document in my Google Drive."], ["Good Time for a Run", "Have a weather report sent to you at 4PM if you haven't met your steps goal yet.\n\nHow it works:\n\nWHEN I haven't met my goal by 4:00PM on my Misfit...\n\nTHEN generate a Weather report...\n\nTHEN Email me the report with a reminder to get going."], ["Activity Tracker", "Store your daily activities to Evernote.\n\nHow it works:\n\nWHEN it's 6am generate yesterday's Misfit activity report...\n\nTHEN save the info to Evernote."]], "actions": [], "triggers": ["Daily goal achieved", "Daily goal not achieved", "Sleep duration above", "Sleep duration below", "New activity session logged", "Generate activity summary"]}, "Homeboy": {"name": "Homeboy", "flows": [["Leave Home and Arm My Homeboy", "Arm your Homeboy location when you leave home and log the info to a Google Drive Sheet.\n\nHow it works:\nWHEN I leave a Location area...\n\nTHEN arm my Homeboy camera's location...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with time,\nAND send me a push notification."], ["Arrive Home and Disarm My Homeboy", "Disarm your Homeboy location when you arrive home and save the info to a Google Drive Sheet.\n\nHow it works:\nWHEN I enter my home Location area...\n\nTHEN disarm my Homeboy camera's location...\n\nTHEN add a row to a Google Sheets spreadsheet on my Google Drive with the time,\nAND send me a push notification."], ["Security Archives", "Backup your video footage to Dropbox.\n\nHow it works:\nWHEN my Homeboy captures new video...\n\nTHEN upload the video file to my Dropbox,\nAND send me a push notification."], ["Alexa Recording Video", "Record a video by asking Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify to record video\"...\n\nTHEN record video on my Homeboy...\n\nTHEN send me an Email with the thumbnail and link to video."], ["Nighttime Video", "Turn on the exterior light for 7 minutes when a new video is captured.\n\nHow it works:\nWHEN my Homeboy captures new video,\nONLY IF it is nighttime...\n\nTHEN turn on my Dimmer Switch...\n\nTHEN start my Time for 7 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Today's Sunset", "Capture the sunset every day on your Homeboy camera and save it to Flickr.\n\nHow it works:\nWHEN it is sunset...\n\nTHEN record video on my Homeboy...\n\nTHEN upload the thumbnail to Flickr,\nAND send me an Email."]], "actions": ["Arm this camera's location", "Disarm this camera's location", "Arm this camera", "Disarm this camera", "Record video"], "triggers": ["Camera's location is armed", "Camera's location is disarmed", "Camera is armed", "Camera disarmed", "Audio alarm triggered", "New video captured", "Battery is low", "Camera status is armed", "Camera status is disarmed"]}, "Functions: Variables": {"name": "Functions: Variables", "flows": [["Reward Variable = 60", "Pair this Flow with \"Kids Reward Plus 15\" to keep track of gaming time for your kids.\n\nHow it works:\nWHEN the Date and Time is midnight...\n\nTHEN set a Variable called Reward to a 60."], ["Kid's Reward Plus 15", "Pair this Flow with \"Reward Variable = 60\" to keep track of your kid's gaming time. Reward initially set to 60 minutes and each time you hit the Button, 15 minutes is added.\n\nHow it works:\nWHEN I press the Green Button...\n\nTHEN increment the Reward Variable by 15 mins...\n\nTHEN send me a push notification with the latest value."], ["Guests Variable", "Pair this Flow with \"Guests\" and look at \"Check for Guests Before Turning Off\" as a use case example. This Flow will set a Variable called Guests to False every day at 4am.\n\nHow it works:\nWHEN the Date and Time is 4am...\n\nTHEN set variable \"Guests\" to False."], ["Guests", "Pair this Flow with \"Guests Variable\" and look at \"Check for Guests Before Turning Off\" as a sibling use case example. This Flow will set a Variable called Guests to True using Alexa.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Guests\"...\n\nTHEN set variable Guests to True."], ["Check For Guests Before Turning Off", "Pair this Flow with \"Guests Variable\" and look at \"Guests\" as a sibling use case example. This Flow will check a Variable called Guests before deciding whether or not to turn off the Hue at 11pm.\n\nHow it works:\nWHEN the Date and Time is 11pm,\nONLY IF when a variable Guest matches False...\n\nTHEN turn off my Hue Bulb A19."], ["Already Run", "Use this Flow in conjunction with Flows you only want to run once per day - like greeting people as they come home, ignoring motion triggers, etc.\n\nHow it works:\nWHEN the Date and Time is 12pm...\n\nTHEN set variable Already Run to False."]], "actions": ["Set variable to a value", "Increment a variable", "Get the value of variable(s)", "Decrement a variable", "Delete a variable", "Append text to a variable value"], "triggers": ["When a variable changes to a value", "A variable matches a value", "When a variable value rises above", "When a variable value falls below", "A variable is above a value", "A variable is below a value", "When a variable changes"]}, "Twitter": {"triggers": ["Someone tweets", "Someone tweets from an area", "Anyone tweets from an area", "Someone sends me a Direct Message (DM)", "I update my profile picture", "I update my bio", "I have a new follower", "I like a tweet"], "flows": [["Sync Profile Pics", "Sync your social media profile pictures.\n\nHow it works:\nWHEN I change my profile picture on Facebook…\n\nTHEN update my profile picture on Twitter with the <Image>."], ["Like A Tweet...Share A Tweet", "Automatically post liked tweets to Facebook\n\nWHEN you like a tweet on Twitter...\n\nTHEN post it on Facebook"], ["Tech Tweets", "Tweet the latest Mobile news from TechCrunch.\n\nHow it works:\nWHEN a new story is added to the Mobile section on TechCrunch...\n\nTHEN tweet on Twitter."], ["Streamer Post On Twitter", "Automatically post to Twitter when you go live on Twitch.\n\nHow it works:\nWHEN a specific user's stream goes live (yours)...\n\nTHEN tweet on Twitter your info, URL, etc."], ["Tweet & Slack Shared Links", "Share interesting links\n\nWHEN you share a link on Facebook...\n\nTHEN tweet it on Twitter...\nAND share with your co-workers on Slack."]], "actions": ["Tweet", "Send a Direct Message (DM) to myself", "Update my profile photo", "Update my bio", "Get what is trending"], "name": "Twitter"}, "CNN": {"name": "CNN", "flows": [["Biz Notes", "Keep up to date by saving Business off NYT and CNN to Evernote.\n\n\nHow it works:\nWHEN a new article is added to the Business section on New York Times...\n\nOR\n\nWHEN a new story is added to the Business section on CNN...\n\nTHEN append to a note on Evernote."], ["IOT News", "Send yourself a Notification when IOT News hits CNN or Lifehacker.\n\nHow it works:\nWHEN a new story is added based on IOT search terms on CNN...\n\nOR\n\nWHEN there is a new item that matches IOT search term on the Lifehacker RSS Feed...\n\nTHEN send me a push notification with the title and URL."], ["Light Up the News", "Have your Hue turn red - then fade off - when CNN posts a top news story.\n\nHow it works:\nWHEN a new story is added to a section on CNN...\n\nTHEN turn on my Hue Bulb A19 to red,\nAND send me a push notification with the title, description and URL...\n\nTHEN fade off my Hue Bulb A19 over 2 minutes."], ["Entertainment News", "When CNN posts a new entertainment story, blink your LIFX, send an email and save the pic to Google Drive.\n\nHow it works:\nWHEN a new story is added to the entertainment section on CNN...\n\nTHEN upload the thumbnail to my Google Drive,\nAND blink my LIFX Color,\nAND send me an Email."], ["Tech News", "Get the latest tech news from TechCrunch, Yahoo! News and CNN via push notifications.\n\nHow it works:\nWHEN a new story is added to the gadgets section on TechCrunch...\n\nOR\n\nWHEN a new story is added to the technology section on CNN...\n\nOR\n\nWHEN a new story is added to the technology section on Yahoo News...\n\nTHEN send me a push notification."], ["Health Story", "Tweet new stories about Health from CNN and send the post to your email.\n\nHow it works:\nWHEN a new story is added to a section on CNN...\n\nTHEN send me an Email with the story information,\nAND tweet the story on Twitter with #health."], ["Light Up the News", "Have your Hue turn red - then fade off - when CNN posts a top news story.\n\nHow it works:\nWHEN a new story is added to a section on CNN...\n\nTHEN turn on my Hue Bulb A19 to red,\nAND send me a push notification with the title, description and URL...\n\nTHEN fade off my Hue Bulb A19 over 2 minutes."]], "actions": [], "triggers": ["New story added to a section", "New story based on search term"]}, "TechCrunch": {"triggers": ["New story added to a section", "New story based on search terms", "New story by a TechCrunch author"], "flows": [["Startup News", "Receive a Notification when a new TechCrunch story about startups is posted.\n\nHow it works:\nWHEN a new story is added to the Startups section on TechCrunch...\n\nTHEN send me a push notification."], ["Slack Latest Smarthome News", "Post the latest smarthome news from CNET, Mashable, Buzzfeed and TechCrunch to Slack.\n\nHow it works:\nWHEN a new smarthome story is added on TechCrunch...\n\nOR\n\nWHEN a new smarthome post is added on BuzzFeed...\n\nOR\n\nWHEN there is a new smarthome item on the Mashable RSS Feed...\n\nOR\n\nWHEN a new smarthome post is added on CNET...\n\nTHEN post the message to a channel on Slack."], ["Gadgets Galore", "Receive a Notification when there is a new post on TechCrunch's gadget section or on Gizmodo.\n\nHow it works:\nWHEN a new story is added to the gadgets section on TechCrunch...\n\nOR\n\nWHEN there is a new item added to the Gizmodo RSS Feed...\n\nTHEN send me a push notification."], ["Tech Tweets", "Tweet the latest Mobile news from TechCrunch.\n\nHow it works:\nWHEN a new story is added to the Mobile section on TechCrunch...\n\nTHEN tweet on Twitter."], ["Tech Sheets", "Save the latest Tech stories from Yahoo and TechCrunch to a Google Sheet.\n\nHow it works:\nWHEN a new story is added to the tech section on Yahoo News...\n\nOR\n\nWHEN a new story is added to a section on TechCrunch...\n\nTHEN append to a text document in my Google Drive."], ["Frederic's Thoughts", "Get the latest articles from Frederic Lardinois emailed directly to your inbox.\n\nHow it works:\nWHEN a new story is added by a TechCrunch author on TechCrunch...\n\nTHEN send me an Email."]], "actions": [], "name": "TechCrunch"}, "BuzzFeed": {"name": "BuzzFeed", "flows": [["Funny Feeds", "Save laugh out loud badged Buzzfeeds to Evernote.\n\nHow it works:\nWHEN a new post is added with a LOL badge on BuzzFeed...\n\nTHEN append to a note on Evernote."], ["Political Update", "Receive political story updates from Yahoo!, Buzzfeed and CNN.\n\nWHEN a new post is added to a section on BuzzFeed...\n\nOR\n\nWHEN a new story is added to a section on Yahoo News...\n\nOR\n\nWHEN a new story is added to a section on CNN...\n\nTHEN send me an Email with the title, description and URL."], ["Fail!", "Follow funny Fails on Buzzfeed and Reddit.\n\nHow it works:\nWHEN a new post is added with a Fail badge on BuzzFeed...\n\nOR\n\nWHEN a new post is added to the facepalm subreddit on Reddit...\n\nTHEN send me a push notification."], ["Cool Tech", "Tech updates from Mashable, Buzzfeed and CNET in your inbox.\n\nHow it works:\nWHEN there is a new item added to the Mashable RSS Feed...\n\nOR\n\nWHEN a new post is added to the Crave feed on CNET...\n\nOR\n\nWHEN a new post is added to the Tech section on BuzzFeed...\n\nTHEN send me an Email with the title, description and URL."], ["Animal Pics", "Save animal pics from Buzzfeed to Google Drive.\n\nHow it works:\nWHEN a new post is added to the Animals section on BuzzFeed...\n\nTHEN upload the thumbnail to my Google Drive."], ["Book Worm", "Book updates from NYT and Buzzfeed via push notifications.\n\nHow it works:\nWHEN there is a new book added to the fiction best seller list on New York Times...\n\nOR\n\nWHEN there is a new book added to the non-fiction best seller list on New York Times...\n\nOR\n\nWHEN a new post is added to the book section on BuzzFeed...\n\nTHEN send me a push notification."]], "actions": [], "triggers": ["New post added to a section", "New post with a badge", "New post based on search term"]}, "TP-Link": {"name": "TP-Link", "flows": [], "actions": [], "triggers": []}, "Timer": {"triggers": [], "flows": [["Timeout", "Give your 7 year old a 7 minute timeout with Alexa and LIFX.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify Timeout\"...\n\nTHEN turn on my LIFX Color to red,\nAND set my Timer for 7 minutes...\n\nTHEN turn off my LIFX Color."], ["Middle Of The Night Bathroom Break", "Turn on your light for 5 minutes at 15% brightness when there is a motion detected between 11pm and 6am.\n\nHow it works:\nWHEN new motion is detected on my Motion Sensor,\nONLY IF the Time is between 11pm and 6am...\n\nTHEN set brightness on my Dimmer Switch to 15%,\nAND start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Smart Alert", "Quick alarm system that turns on a light for 5 minutes and calls a phone number via IFTTT when your location is not at home and either a motion is detected or the door opens. Must be paired with the Stringify applet on IFTTT.\n\nHow it works:\nWHEN my Open/Close Sensor opens,\n\nOR\n\nWHEN a new motion is detected on my Motions sensor...\n\nAND ONLY IF I am away from my home Location ...\n\nTHEN turn on my Dimmer Switch,\nAND run an IFTTT Applet to call a phone number...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Dimmer Switch."], ["Nest Pest Arrest", "Turn on your spotlights for 10 minutes when your Nest Cam detects nighttime motion.\n\nHow it works:\nWHEN new motion is detected on my Nest Camera,\nONLY IF it is nighttime...\n\nTHEN turn on my Dimmer Switch,\nAND start my Timer for 10 minutes,\nAND send me a Notification with the image...\n\nTHEN turn off my Dimmer Switch."], ["Nighttime Watch", "Let Arlo watch your back at the nighttime\n\nWHEN motion is detected on my Arlo,\nONLY IF it is nighttime...\n\nTHEN turn on my Hue Color Light\nAND send me a push notification...\n\nTHEN start my Timer for 5 minutes...\n\nTHEN turn off my Hue Color Light."], ["Turbo Timer", "Say \"Alexa, tell Stringify 30 Minute Timer\" and have your Hue turn green...then change to yellow...then red at the 30 minute mark...then eventually turn off.\n\nHow it works:\nWHEN I ask Amazon Alexa \"Alexa, tell Stringify 30 Minute Timer\"...\n\nTHEN turn on my Hue Bulb A19 to green,\nAND start my Timer for 25 minutes...\n\nTHEN turn on my Hue Bulb A19 to yellow,\nAND start my Timer for 5 minutes...\n\nTHEN turn on my Hue Bulb A19 to red,\nAND start my Timer for 10 minutes...\n\nTHEN turn off my Hue Bulb A19."]], "actions": ["Start the timer"], "name": "Timer"}, "Netatmo": {"name": "Netatmo", "flows": [["High Temp", "Turn on your Nest fan when the temperature on your Netatmo station rises above 72F.\n\nHow it works:\nWHEN the temperature rises above 72F on my Netatmo weather station...\n\nTHEN turn the fan timer on or off on my Nest Thermostat,\nAND send me a push notification."], ["Open a Window", "Turn on your Hue to orange and send a Notification when your Netatmo detects CO2 levels over 1000 ppm.\n\nHow it works:\nWHEN the CO2 level rises above 1000 ppm on my Netatmo weather station...\n\nTHEN turn on my Hue Bulb A19 to orange,\nAND send me a push notification telling me to open a window."], ["Personal Welcome", "Get welcomed home personally by Netatmo Welcome and Sonos connected via SmartThings.\n\nHow it works:\nWHEN a known person is detected on my Netatmo Welcome...\n\nTHEN play a custom message on my Sonos welcoming then home by name."], ["New Person at the Door", "Receive an Email with a picture and turn on your Hue when a new person is seen at the front door by your Netatmo Welcome.\n\nHow it works:\nWHEN an unknown person is detected on my Netatmo Welcome...\n\nTHEN turn on my Hue Bulb A19,\nAND send me an Email with the image."], ["Midnight Bathroom Break", "Turn on your Hue light at 15% brightness for 10 minutes when your Netatmo Welcome detects motion during the night.\n\nHow it works:\nWHEN a motion is detected on my Netatmo Welcome,\nONLY IF it is nighttime...\n\nTHEN set brightness on my Hue Bulb A19 to 15%\nAND start my Timer for 10 minutes...\n\nTHEN turn off my Hue Bulb A19."], ["AC Saver", "Turn off your Nest Thermostat when the door has been open for 5 minutes and the temperature is over 80F on your Netatmo Outdoor station.\n\nHow it works:\nWHEN my Contact/Temperature/Motion Sensor is open for a 5 minutes,\nONLY IF temperature is above 80F...\n\nTHEN turn off my Nest Thermostat."]], "actions": [], "triggers": []}, "Smappee Energy Monitor": {"name": "Smappee Energy Monitor", "flows": [["Dishes clean", "When dishes are clean, notify that it's time to empty the dishwasher.\n\nWHEN appliance turns off on my Smappee Energy Monitor...\n\nTHEN send me a push notification."], ["Wash day", "When the washing machine has finished, notify to put clothes in the dryer.\n\nWHEN appliance turns off on my Smappee Energy Monitor...\n\nTHEN send me a push notification,\nAND blink my LIFX Color."], ["Folding time", "When the dryer is done, notify that it's time to take out and fold the clothes.\n\nWHEN appliance turns off on my Smappee Energy Monitor...\n\nTHEN send me a push notification,\nAND blink my LIFX Color."], ["Dinner's ready", "Give the family a 30 minute warning that dinner is ready.\n\nWHEN appliance turns on on my Smappee Energy Monitor...\n\nTHEN play a custom message on my Sonos."], ["Snack time", "Send a notification when snacks are ready.\n\nWHEN appliance turns off on my Smappee Energy Monitor...\n\nTHEN play a custom message on my Sonos."], ["The water is lovely", "When the pool has finished heating, let the family know it's time to swim.\n\nWHEN appliance turns off on my Smappee Energy Monitor...\n\nTHEN play a custom message on my Sonos,\nAND blink my LIFX Color,\nAND send me a push notification."]], "actions": [], "triggers": ["Appliance turns on", "Appliance turns off"]}}
